RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/***************************************************************************//**
 * @file
 * @brief EFM32GG11B_ETH register and bit field definitions
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif


#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/
/***************************************************************************//**
 * @defgroup EFM32GG11B_ETH ETH
 * @{
 * @brief EFM32GG11B_ETH Register Declaration
 ******************************************************************************/
/** ETH Register Declaration */
typedef struct {
  __IOM uint32_t NETWORKCTRL;         /**< Network control register  */
  __IOM uint32_t NETWORKCFG;          /**< Network configuration register  */
  __IM uint32_t  NETWORKSTATUS;       /**< Network status register   */

  uint32_t       RESERVED0[1U];       /**< Reserved for future use **/
  __IOM uint32_t DMACFG;              /**< DMA Configuration Register  */
  __IOM uint32_t TXSTATUS;            /**< Transmit status register  */
  __IOM uint32_t RXQPTR;              /**< Start address of the receive buffer queue  */
  __IOM uint32_t TXQPTR;              /**< Start address of the transmit buffer queue  */
  __IOM uint32_t RXSTATUS;            /**< Receive status register  */
  __IOM uint32_t IFCR;                /**< Interrupt status register  */
  __IOM uint32_t IENS;                /**< Interrupt Enable Register  */
  __IOM uint32_t IENC;                /**< Interrupt Disable Register  */
  __IOM uint32_t IENRO;               /**< Interrupt mask register  */
  __IOM uint32_t PHYMNGMNT;           /**< PHY management register  */
  __IM uint32_t  RXPAUSEQUANT;        /**< Received Pause Quantum Register  */
  __IOM uint32_t TXPAUSEQUANT;        /**< Transmit Pause Quantum Register  */
  __IOM uint32_t PBUFTXCUTTHRU;       /**< TX Partial Store and Forward  */
  __IOM uint32_t PBUFRXCUTTHRU;       /**< RX Partial Store and Forward  */
  __IOM uint32_t JUMBOMAXLEN;         /**< Maximum Jumbo Frame Size.  */

  uint32_t       RESERVED1[4U];       /**< Reserved for future use **/
  __IOM uint32_t IMOD;                /**< Interrupt moderation register  */
  __IOM uint32_t SYSWAKETIME;         /**< System wake time  */
  uint32_t       RESERVED2[7U];       /**< Reserved for future use **/
  __IOM uint32_t HASHBOTTOM;          /**< Hash Register Bottom [31:0]  */
  __IOM uint32_t HASHTOP;             /**< Hash Register Top [63:32]  */
  __IOM uint32_t SPECADDR1BOTTOM;     /**< Specific Address 1 Bottom  */
  __IOM uint32_t SPECADDR1TOP;        /**< Specific Address 1 Top  */
  __IOM uint32_t SPECADDR2BOTTOM;     /**< Specific Address 2 Bottom  */
  __IOM uint32_t SPECADDR2TOP;        /**< Specific Address 2 Top  */
  __IOM uint32_t SPECADDR3BOTTOM;     /**< Specific Address 3 Bottom  */
  __IOM uint32_t SPECADDR3TOP;        /**< Specific Address 3 Top  */
  __IOM uint32_t SPECADDR4BOTTOM;     /**< Specific Address 4 Bottom  */
  __IOM uint32_t SPECADDR4TOP;        /**< Specific Address 4 Top  */
  __IOM uint32_t SPECTYPE1;           /**< Type ID Match 1  */
  __IOM uint32_t SPECTYPE2;           /**< Type ID Match 2  */
  __IOM uint32_t SPECTYPE3;           /**< Type ID Match 3  */
  __IOM uint32_t SPECTYPE4;           /**< Type ID Match 4  */
  __IOM uint32_t WOLREG;              /**< Wake on LAN Register  */
  __IOM uint32_t STRETCHRATIO;        /**< IPG stretch register  */
  __IOM uint32_t STACKEDVLAN;         /**< Stacked VLAN Register  */
  __IOM uint32_t TXPFCPAUSE;          /**< Transmit PFC Pause Register   */
  __IOM uint32_t MASKADD1BOTTOM;      /**< Specific Address Mask 1 Bottom 31:0  */
  __IOM uint32_t MASKADD1TOP;         /**< Specific Address Mask 1 Top 47:32  */

  uint32_t       RESERVED3[1U];       /**< Reserved for future use **/
  __IOM uint32_t RXPTPUNICAST;        /**< PTP RX unicast IP destination address   */
  __IOM uint32_t TXPTPUNICAST;        /**< PTP TX unicast IP destination address   */
  __IOM uint32_t TSUNSECCMP;          /**< TSU timer comparison value nanoseconds   */
  __IOM uint32_t TSUSECCMP;           /**< TSU timer comparison value seconds [31:0]  */
  __IOM uint32_t TSUMSBSECCMP;        /**< TSU timer comparison value seconds [47:32]  */
  __IM uint32_t  TSUPTPTXMSBSEC;      /**< PTP Event Frame Transmitted Seconds Register 47:32  */
  __IM uint32_t  TSUPTPRXMSBSEC;      /**< PTP Event Frame Received Seconds Register 47:32  */
  __IM uint32_t  TSUPEERTXMSBSEC;     /**< PTP Peer Event Frame Transmitted Seconds Register 47:32  */
  __IM uint32_t  TSUPEERRXMSBSEC;     /**< PTP Peer Event Frame Received Seconds Register 47:32  */

  uint32_t       RESERVED4[2U];       /**< Reserved for future use **/
  __IOM uint32_t OCTETSTXEDBOTTOM;    /**< Octets transmitted 31:0  */
  __IOM uint32_t OCTETSTXEDTOP;       /**< Octets Transmitted 47:32  */
  __IOM uint32_t FRAMESTXEDOK;        /**< Frames Transmitted  */
  __IOM uint32_t BROADCASTTXED;       /**< Broadcast Frames Transmitted  */
  __IOM uint32_t MULTICASTTXED;       /**< Multicast Frames Transmitted  */
  __IOM uint32_t PFRAMESTXED;         /**< Pause Frames Transmitted  */
  __IOM uint32_t FRAMESTXED64;        /**< 64 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED65;        /**< 65 to 127 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED128;       /**< 128 to 255 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED256;       /**< 256 to 511 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED512;       /**< 512 to 1023 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED1024;      /**< 1024 to 1518 Byte Frames Transmitted  */
  __IOM uint32_t FRAMESTXED1519;      /**< Greater Than 1518 Byte Frames Transmitted  */
  __IOM uint32_t TXUNDERRUNS;         /**< Transmit Under Runs  */
  __IOM uint32_t SINGLECOLS;          /**< Single Collision Frames  */
  __IOM uint32_t MULTICOLS;           /**< Multiple Collision Frames  */
  __IOM uint32_t EXCESSCOLS;          /**< Excessive Collisions  */
  __IOM uint32_t LATECOLS;            /**< Late Collisions  */
  __IOM uint32_t DEFERREDFRAMES;      /**< Deferred Transmission Frames  */
  __IOM uint32_t CRSERRS;             /**< Carrier Sense Errors  */
  __IOM uint32_t OCTETSRXEDBOTTOM;    /**< Octets Received 31:0  */
  __IOM uint32_t OCTETSRXEDTOP;       /**< Octets Received 47:32  */
  __IOM uint32_t FRAMESRXEDOK;        /**< Frames Received  */
  __IOM uint32_t BROADCASTRXED;       /**< Broadcast Frames Received  */
  __IOM uint32_t MULTICASTRXED;       /**< Multicast Frames Received  */
  __IOM uint32_t PFRAMESRXED;         /**< Pause Frames Received  */
  __IOM uint32_t FRAMESRXED64;        /**< 64 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED65;        /**< 65 to 127 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED128;       /**< 128 to 255 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED256;       /**< 256 to 511 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED512;       /**< 512 to 1023 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED1024;      /**< 1024 to 1518 Byte Frames Received  */
  __IOM uint32_t FRAMESRXED1519;      /**< 1519 to maximum Byte Frames Received  */
  __IOM uint32_t UNDERSIZEFRAMES;     /**< Undersized Frames Received  */
  __IOM uint32_t EXCESSIVERXLEN;      /**< Oversize Frames Received  */
  __IOM uint32_t RXJABBERS;           /**< Jabbers Received  */
  __IOM uint32_t FCSERRS;             /**< Frame Check Sequence Errors  */
  __IOM uint32_t RXLENERRS;           /**< Length Field Frame Errors  */
  __IOM uint32_t RXSYMBOLERRS;        /**< Receive Symbol Errors  */
  __IOM uint32_t ALIGNERRS;           /**< Alignment Errors  */
  __IOM uint32_t RXRESOURCEERRS;      /**< Receive Resource Errors  */
  __IOM uint32_t RXOVERRUNS;          /**< Receive Overruns  */
  __IOM uint32_t RXIPCKERRS;          /**< IP Header Checksum Errors  */
  __IOM uint32_t RXTCPCKERRS;         /**< TCP Checksum Errors  */
  __IOM uint32_t RXUDPCKERRS;         /**< UDP Checksum Errors  */
  __IOM uint32_t AUTOFLUSHEDPKTS;     /**< Receive DMA Flushed Packets  */
  uint32_t       RESERVED5[1U];       /**< Reserved for future use **/
  __IOM uint32_t TSUTIMERINCRSUBNSEC; /**< 1588 Timer Increment Register subscript nsec  */
  __IOM uint32_t TSUTIMERMSBSEC;      /**< 1588 Timer Seconds Register 47:32  */

