RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
  uint32_t       RESERVED6[3U];       /**< Reserved for future use **/
  __IOM uint32_t TSUTIMERSEC;         /**< 1588 Timer Seconds Register 31:0  */
  __IOM uint32_t TSUTIMERNSEC;        /**< 1588 Timer Nanoseconds Register  */
  __IOM uint32_t TSUTIMERADJUST;      /**< This register returns all zeroes when read.  */
  __IOM uint32_t TSUTIMERINCR;        /**< 1588 Timer Increment Register  */
  __IM uint32_t  TSUPTPTXSEC;         /**< PTP Event Frame Transmitted Seconds Register 31:0  */
  __IM uint32_t  TSUPTPTXNSEC;        /**< PTP Event Frame Transmitted Nanoseconds Register  */
  __IM uint32_t  TSUPTPRXSEC;         /**< PTP Event Frame Received Seconds Register 31:0  */
  __IM uint32_t  TSUPTPRXNSEC;        /**< PTP Event Frame Received Nanoseconds Register  */
  __IM uint32_t  TSUPEERTXSEC;        /**< PTP Peer Event Frame Transmitted Seconds Register 31:0  */
  __IM uint32_t  TSUPEERTXNSEC;       /**< PTP Peer Event Frame Transmitted Nanoseconds Register  */
  __IM uint32_t  TSUPEERRXSEC;        /**< PTP Peer Event Frame Received Seconds Register 31:0  */
  __IM uint32_t  TSUPEERRXNSEC;       /**< PTP Peer Event Frame Received Nanoseconds Register  */

  uint32_t       RESERVED7[24U];      /**< Reserved for future use **/
  __IOM uint32_t TXPAUSEQUANT1;       /**< Transmit Pause Quantum Register 1  */
  __IOM uint32_t TXPAUSEQUANT2;       /**< Transmit Pause Quantum Register 2  */
  __IOM uint32_t TXPAUSEQUANT3;       /**< Transmit Pause Quantum Register 3  */
  uint32_t       RESERVED8[1U];       /**< Reserved for future use **/
  __IOM uint32_t RXLPI;               /**< Received LPI transitions  */
  __IOM uint32_t RXLPITIME;           /**< Received LPI time  */
  __IOM uint32_t TXLPI;               /**< Transmit LPI transitions  */
  __IOM uint32_t TXLPITIME;           /**< Transmit LPI time  */

  uint32_t       RESERVED9[147U];     /**< Reserved for future use **/
  __IOM uint32_t TXBDCTRL;            /**< TX BD control register  */
  __IOM uint32_t RXBDCTRL;            /**< RX BD control register  */

  uint32_t       RESERVED10[459U];    /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;            /**< I/O Route Enable Register   */
  __IOM uint32_t ROUTELOC0;           /**< I/O Route Location Register 0  */
  uint32_t       RESERVED11[1U];      /**< Reserved for future use **/
  __IOM uint32_t ROUTELOC1;           /**< I/O Route Location Register 1  */
  __IOM uint32_t CTRL;                /**< Ethernet control register  */
} ETH_TypeDef;                        /** @} */

/***************************************************************************//**
 * @addtogroup EFM32GG11B_ETH
 * @{
 * @defgroup EFM32GG11B_ETH_BitFields  ETH Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for ETH NETWORKCTRL */
#define _ETH_NETWORKCTRL_RESETVALUE                      0x00000000UL                                     /**< Default value for ETH_NETWORKCTRL */
#define _ETH_NETWORKCTRL_MASK                            0x035F9FFEUL                                     /**< Mask for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_LOOPBACKLOCAL                    (0x1UL << 1)                                     /**< Loopback local */
#define _ETH_NETWORKCTRL_LOOPBACKLOCAL_SHIFT             1                                                /**< Shift value for ETH_LOOPBACKLOCAL */
#define _ETH_NETWORKCTRL_LOOPBACKLOCAL_MASK              0x2UL                                            /**< Bit mask for ETH_LOOPBACKLOCAL */
#define _ETH_NETWORKCTRL_LOOPBACKLOCAL_DEFAULT           0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_LOOPBACKLOCAL_DEFAULT            (_ETH_NETWORKCTRL_LOOPBACKLOCAL_DEFAULT << 1)    /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ENBRX                            (0x1UL << 2)                                     /**< Receive enable */
#define _ETH_NETWORKCTRL_ENBRX_SHIFT                     2                                                /**< Shift value for ETH_ENBRX */
#define _ETH_NETWORKCTRL_ENBRX_MASK                      0x4UL                                            /**< Bit mask for ETH_ENBRX */
#define _ETH_NETWORKCTRL_ENBRX_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ENBRX_DEFAULT                    (_ETH_NETWORKCTRL_ENBRX_DEFAULT << 2)            /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ENBTX                            (0x1UL << 3)                                     /**< Transmit enable */
#define _ETH_NETWORKCTRL_ENBTX_SHIFT                     3                                                /**< Shift value for ETH_ENBTX */
#define _ETH_NETWORKCTRL_ENBTX_MASK                      0x8UL                                            /**< Bit mask for ETH_ENBTX */
#define _ETH_NETWORKCTRL_ENBTX_DEFAULT                   0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ENBTX_DEFAULT                    (_ETH_NETWORKCTRL_ENBTX_DEFAULT << 3)            /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_MANPORTEN                        (0x1UL << 4)                                     /**< Management port enable */
#define _ETH_NETWORKCTRL_MANPORTEN_SHIFT                 4                                                /**< Shift value for ETH_MANPORTEN */
#define _ETH_NETWORKCTRL_MANPORTEN_MASK                  0x10UL                                           /**< Bit mask for ETH_MANPORTEN */
#define _ETH_NETWORKCTRL_MANPORTEN_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_MANPORTEN_DEFAULT                (_ETH_NETWORKCTRL_MANPORTEN_DEFAULT << 4)        /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_CLRALLSTATSREGS                  (0x1UL << 5)                                     /**< Clear statistics registers */
#define _ETH_NETWORKCTRL_CLRALLSTATSREGS_SHIFT           5                                                /**< Shift value for ETH_CLRALLSTATSREGS */
#define _ETH_NETWORKCTRL_CLRALLSTATSREGS_MASK            0x20UL                                           /**< Bit mask for ETH_CLRALLSTATSREGS */
#define _ETH_NETWORKCTRL_CLRALLSTATSREGS_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_CLRALLSTATSREGS_DEFAULT          (_ETH_NETWORKCTRL_CLRALLSTATSREGS_DEFAULT << 5)  /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_INCALLSTATSREGS                  (0x1UL << 6)                                     /**< Incremental statistics registers */
#define _ETH_NETWORKCTRL_INCALLSTATSREGS_SHIFT           6                                                /**< Shift value for ETH_INCALLSTATSREGS */
#define _ETH_NETWORKCTRL_INCALLSTATSREGS_MASK            0x40UL                                           /**< Bit mask for ETH_INCALLSTATSREGS */
#define _ETH_NETWORKCTRL_INCALLSTATSREGS_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_INCALLSTATSREGS_DEFAULT          (_ETH_NETWORKCTRL_INCALLSTATSREGS_DEFAULT << 6)  /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STATSWREN                        (0x1UL << 7)                                     /**< Write enable for statistics registers */
#define _ETH_NETWORKCTRL_STATSWREN_SHIFT                 7                                                /**< Shift value for ETH_STATSWREN */
#define _ETH_NETWORKCTRL_STATSWREN_MASK                  0x80UL                                           /**< Bit mask for ETH_STATSWREN */
#define _ETH_NETWORKCTRL_STATSWREN_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STATSWREN_DEFAULT                (_ETH_NETWORKCTRL_STATSWREN_DEFAULT << 7)        /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_BACKPRESSURE                     (0x1UL << 8)                                     /**< Back pressure will force collisions on all received frames */
#define _ETH_NETWORKCTRL_BACKPRESSURE_SHIFT              8                                                /**< Shift value for ETH_BACKPRESSURE */
#define _ETH_NETWORKCTRL_BACKPRESSURE_MASK               0x100UL                                          /**< Bit mask for ETH_BACKPRESSURE */
#define _ETH_NETWORKCTRL_BACKPRESSURE_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_BACKPRESSURE_DEFAULT             (_ETH_NETWORKCTRL_BACKPRESSURE_DEFAULT << 8)     /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXSTRT                           (0x1UL << 9)                                     /**< Start transmission */
#define _ETH_NETWORKCTRL_TXSTRT_SHIFT                    9                                                /**< Shift value for ETH_TXSTRT */
#define _ETH_NETWORKCTRL_TXSTRT_MASK                     0x200UL                                          /**< Bit mask for ETH_TXSTRT */
#define _ETH_NETWORKCTRL_TXSTRT_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXSTRT_DEFAULT                   (_ETH_NETWORKCTRL_TXSTRT_DEFAULT << 9)           /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXHALT                           (0x1UL << 10)                                    /**< Transmit halt */
#define _ETH_NETWORKCTRL_TXHALT_SHIFT                    10                                               /**< Shift value for ETH_TXHALT */
#define _ETH_NETWORKCTRL_TXHALT_MASK                     0x400UL                                          /**< Bit mask for ETH_TXHALT */
#define _ETH_NETWORKCTRL_TXHALT_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXHALT_DEFAULT                   (_ETH_NETWORKCTRL_TXHALT_DEFAULT << 10)          /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFRMREQ                        (0x1UL << 11)                                    /**< Transmit pause frame  */
#define _ETH_NETWORKCTRL_TXPFRMREQ_SHIFT                 11                                               /**< Shift value for ETH_TXPFRMREQ */
#define _ETH_NETWORKCTRL_TXPFRMREQ_MASK                  0x800UL                                          /**< Bit mask for ETH_TXPFRMREQ */
#define _ETH_NETWORKCTRL_TXPFRMREQ_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFRMREQ_DEFAULT                (_ETH_NETWORKCTRL_TXPFRMREQ_DEFAULT << 11)       /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFRMZERO                       (0x1UL << 12)                                    /**< Transmit zero quantum pause frame  */
#define _ETH_NETWORKCTRL_TXPFRMZERO_SHIFT                12                                               /**< Shift value for ETH_TXPFRMZERO */
#define _ETH_NETWORKCTRL_TXPFRMZERO_MASK                 0x1000UL                                         /**< Bit mask for ETH_TXPFRMZERO */
#define _ETH_NETWORKCTRL_TXPFRMZERO_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFRMZERO_DEFAULT               (_ETH_NETWORKCTRL_TXPFRMZERO_DEFAULT << 12)      /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STORERXTS                        (0x1UL << 15)                                    /**< Store receive time stamp to memory. */
#define _ETH_NETWORKCTRL_STORERXTS_SHIFT                 15                                               /**< Shift value for ETH_STORERXTS */
#define _ETH_NETWORKCTRL_STORERXTS_MASK                  0x8000UL                                         /**< Bit mask for ETH_STORERXTS */
#define _ETH_NETWORKCTRL_STORERXTS_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STORERXTS_DEFAULT                (_ETH_NETWORKCTRL_STORERXTS_DEFAULT << 15)       /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PFCENB                           (0x1UL << 16)                                    /**< Enable PFC Priority Based Pause Reception capabilities. */
#define _ETH_NETWORKCTRL_PFCENB_SHIFT                    16                                               /**< Shift value for ETH_PFCENB */
#define _ETH_NETWORKCTRL_PFCENB_MASK                     0x10000UL                                        /**< Bit mask for ETH_PFCENB */
#define _ETH_NETWORKCTRL_PFCENB_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PFCENB_DEFAULT                   (_ETH_NETWORKCTRL_PFCENB_DEFAULT << 16)          /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFCPRIORPFRM                   (0x1UL << 17)                                    /**< Write a one to transmit PFC priority based pause frame. */
#define _ETH_NETWORKCTRL_TXPFCPRIORPFRM_SHIFT            17                                               /**< Shift value for ETH_TXPFCPRIORPFRM */
#define _ETH_NETWORKCTRL_TXPFCPRIORPFRM_MASK             0x20000UL                                        /**< Bit mask for ETH_TXPFCPRIORPFRM */
#define _ETH_NETWORKCTRL_TXPFCPRIORPFRM_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXPFCPRIORPFRM_DEFAULT           (_ETH_NETWORKCTRL_TXPFCPRIORPFRM_DEFAULT << 17)  /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_FLUSHRXPKT                       (0x1UL << 18)                                    /**< Flush the next packet from the external RX DPRAM. */
#define _ETH_NETWORKCTRL_FLUSHRXPKT_SHIFT                18                                               /**< Shift value for ETH_FLUSHRXPKT */
#define _ETH_NETWORKCTRL_FLUSHRXPKT_MASK                 0x40000UL                                        /**< Bit mask for ETH_FLUSHRXPKT */
#define _ETH_NETWORKCTRL_FLUSHRXPKT_DEFAULT              0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_FLUSHRXPKT_DEFAULT               (_ETH_NETWORKCTRL_FLUSHRXPKT_DEFAULT << 18)      /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXLPIEN                          (0x1UL << 19)                                    /**< Enable LPI transmission when set LPI (low power idle) is immediately transmitted. */
#define _ETH_NETWORKCTRL_TXLPIEN_SHIFT                   19                                               /**< Shift value for ETH_TXLPIEN */
#define _ETH_NETWORKCTRL_TXLPIEN_MASK                    0x80000UL                                        /**< Bit mask for ETH_TXLPIEN */
#define _ETH_NETWORKCTRL_TXLPIEN_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_TXLPIEN_DEFAULT                  (_ETH_NETWORKCTRL_TXLPIEN_DEFAULT << 19)         /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PTPUNICASTEN                     (0x1UL << 20)                                    /**< Enable detection of unicast PTP unicast frames. */
#define _ETH_NETWORKCTRL_PTPUNICASTEN_SHIFT              20                                               /**< Shift value for ETH_PTPUNICASTEN */
#define _ETH_NETWORKCTRL_PTPUNICASTEN_MASK               0x100000UL                                       /**< Bit mask for ETH_PTPUNICASTEN */
#define _ETH_NETWORKCTRL_PTPUNICASTEN_DEFAULT            0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PTPUNICASTEN_DEFAULT             (_ETH_NETWORKCTRL_PTPUNICASTEN_DEFAULT << 20)    /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STOREUDPOFFSET                   (0x1UL << 22)                                    /**< Store UDP / TCP offset to memory. */
#define _ETH_NETWORKCTRL_STOREUDPOFFSET_SHIFT            22                                               /**< Shift value for ETH_STOREUDPOFFSET */
#define _ETH_NETWORKCTRL_STOREUDPOFFSET_MASK             0x400000UL                                       /**< Bit mask for ETH_STOREUDPOFFSET */
#define _ETH_NETWORKCTRL_STOREUDPOFFSET_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_STOREUDPOFFSET_DEFAULT           (_ETH_NETWORKCTRL_STOREUDPOFFSET_DEFAULT << 22)  /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ONESTEPSYNCMODE                  (0x1UL << 24)                                    /**< 1588 One Step Sync Mode.  */
#define _ETH_NETWORKCTRL_ONESTEPSYNCMODE_SHIFT           24                                               /**< Shift value for ETH_ONESTEPSYNCMODE */
#define _ETH_NETWORKCTRL_ONESTEPSYNCMODE_MASK            0x1000000UL                                      /**< Bit mask for ETH_ONESTEPSYNCMODE */
#define _ETH_NETWORKCTRL_ONESTEPSYNCMODE_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_ONESTEPSYNCMODE_DEFAULT          (_ETH_NETWORKCTRL_ONESTEPSYNCMODE_DEFAULT << 24) /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PFCCTRL                          (0x1UL << 25)                                    /**< Enable multiple PFC pause quantums, one per pause priority */
#define _ETH_NETWORKCTRL_PFCCTRL_SHIFT                   25                                               /**< Shift value for ETH_PFCCTRL */
#define _ETH_NETWORKCTRL_PFCCTRL_MASK                    0x2000000UL                                      /**< Bit mask for ETH_PFCCTRL */
#define _ETH_NETWORKCTRL_PFCCTRL_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for ETH_NETWORKCTRL */
#define ETH_NETWORKCTRL_PFCCTRL_DEFAULT                  (_ETH_NETWORKCTRL_PFCCTRL_DEFAULT << 25)         /**< Shifted mode DEFAULT for ETH_NETWORKCTRL */

