RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH TXSTATUS */
#define _ETH_TXSTATUS_RESETVALUE                         0x00000000UL                              /**< Default value for ETH_TXSTATUS */
#define _ETH_TXSTATUS_MASK                               0x000001FFUL                              /**< Mask for ETH_TXSTATUS */
#define ETH_TXSTATUS_USEDBITREAD                         (0x1UL << 0)                              /**< Used bit read */
#define _ETH_TXSTATUS_USEDBITREAD_SHIFT                  0                                         /**< Shift value for ETH_USEDBITREAD */
#define _ETH_TXSTATUS_USEDBITREAD_MASK                   0x1UL                                     /**< Bit mask for ETH_USEDBITREAD */
#define _ETH_TXSTATUS_USEDBITREAD_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_USEDBITREAD_DEFAULT                 (_ETH_TXSTATUS_USEDBITREAD_DEFAULT << 0)  /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_COLOCCRD                            (0x1UL << 1)                              /**< Collision occurred */
#define _ETH_TXSTATUS_COLOCCRD_SHIFT                     1                                         /**< Shift value for ETH_COLOCCRD */
#define _ETH_TXSTATUS_COLOCCRD_MASK                      0x2UL                                     /**< Bit mask for ETH_COLOCCRD */
#define _ETH_TXSTATUS_COLOCCRD_DEFAULT                   0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_COLOCCRD_DEFAULT                    (_ETH_TXSTATUS_COLOCCRD_DEFAULT << 1)     /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_RETRYLMTEXCD                        (0x1UL << 2)                              /**< Retry limit exceeded */
#define _ETH_TXSTATUS_RETRYLMTEXCD_SHIFT                 2                                         /**< Shift value for ETH_RETRYLMTEXCD */
#define _ETH_TXSTATUS_RETRYLMTEXCD_MASK                  0x4UL                                     /**< Bit mask for ETH_RETRYLMTEXCD */
#define _ETH_TXSTATUS_RETRYLMTEXCD_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_RETRYLMTEXCD_DEFAULT                (_ETH_TXSTATUS_RETRYLMTEXCD_DEFAULT << 2) /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXGO                                (0x1UL << 3)                              /**< Transmit go */
#define _ETH_TXSTATUS_TXGO_SHIFT                         3                                         /**< Shift value for ETH_TXGO */
#define _ETH_TXSTATUS_TXGO_MASK                          0x8UL                                     /**< Bit mask for ETH_TXGO */
#define _ETH_TXSTATUS_TXGO_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXGO_DEFAULT                        (_ETH_TXSTATUS_TXGO_DEFAULT << 3)         /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_AMBAERR                             (0x1UL << 4)                              /**< Transmit frame corruption due to AMBA (AHB) errors. */
#define _ETH_TXSTATUS_AMBAERR_SHIFT                      4                                         /**< Shift value for ETH_AMBAERR */
#define _ETH_TXSTATUS_AMBAERR_MASK                       0x10UL                                    /**< Bit mask for ETH_AMBAERR */
#define _ETH_TXSTATUS_AMBAERR_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_AMBAERR_DEFAULT                     (_ETH_TXSTATUS_AMBAERR_DEFAULT << 4)      /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXCMPLT                             (0x1UL << 5)                              /**< Transmit complete */
#define _ETH_TXSTATUS_TXCMPLT_SHIFT                      5                                         /**< Shift value for ETH_TXCMPLT */
#define _ETH_TXSTATUS_TXCMPLT_MASK                       0x20UL                                    /**< Bit mask for ETH_TXCMPLT */
#define _ETH_TXSTATUS_TXCMPLT_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXCMPLT_DEFAULT                     (_ETH_TXSTATUS_TXCMPLT_DEFAULT << 5)      /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXUNDERRUN                          (0x1UL << 6)                              /**< Transmit under run */
#define _ETH_TXSTATUS_TXUNDERRUN_SHIFT                   6                                         /**< Shift value for ETH_TXUNDERRUN */
#define _ETH_TXSTATUS_TXUNDERRUN_MASK                    0x40UL                                    /**< Bit mask for ETH_TXUNDERRUN */
#define _ETH_TXSTATUS_TXUNDERRUN_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_TXUNDERRUN_DEFAULT                  (_ETH_TXSTATUS_TXUNDERRUN_DEFAULT << 6)   /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_LATECOLOCCRD                        (0x1UL << 7)                              /**< Late collision occurred */
#define _ETH_TXSTATUS_LATECOLOCCRD_SHIFT                 7                                         /**< Shift value for ETH_LATECOLOCCRD */
#define _ETH_TXSTATUS_LATECOLOCCRD_MASK                  0x80UL                                    /**< Bit mask for ETH_LATECOLOCCRD */
#define _ETH_TXSTATUS_LATECOLOCCRD_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_LATECOLOCCRD_DEFAULT                (_ETH_TXSTATUS_LATECOLOCCRD_DEFAULT << 7) /**< Shifted mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_RESPNOTOK                           (0x1UL << 8)                              /**< bresp/hresp not OK */
#define _ETH_TXSTATUS_RESPNOTOK_SHIFT                    8                                         /**< Shift value for ETH_RESPNOTOK */
#define _ETH_TXSTATUS_RESPNOTOK_MASK                     0x100UL                                   /**< Bit mask for ETH_RESPNOTOK */
#define _ETH_TXSTATUS_RESPNOTOK_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for ETH_TXSTATUS */
#define ETH_TXSTATUS_RESPNOTOK_DEFAULT                   (_ETH_TXSTATUS_RESPNOTOK_DEFAULT << 8)    /**< Shifted mode DEFAULT for ETH_TXSTATUS */

/* Bit fields for ETH RXQPTR */
#define _ETH_RXQPTR_RESETVALUE                           0x00000000UL                         /**< Default value for ETH_RXQPTR */
#define _ETH_RXQPTR_MASK                                 0xFFFFFFFCUL                         /**< Mask for ETH_RXQPTR */
#define _ETH_RXQPTR_DMARXQPTR_SHIFT                      2                                    /**< Shift value for ETH_DMARXQPTR */
#define _ETH_RXQPTR_DMARXQPTR_MASK                       0xFFFFFFFCUL                         /**< Bit mask for ETH_DMARXQPTR */
#define _ETH_RXQPTR_DMARXQPTR_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_RXQPTR */
#define ETH_RXQPTR_DMARXQPTR_DEFAULT                     (_ETH_RXQPTR_DMARXQPTR_DEFAULT << 2) /**< Shifted mode DEFAULT for ETH_RXQPTR */

/* Bit fields for ETH TXQPTR */
#define _ETH_TXQPTR_RESETVALUE                           0x00000000UL                         /**< Default value for ETH_TXQPTR */
#define _ETH_TXQPTR_MASK                                 0xFFFFFFFCUL                         /**< Mask for ETH_TXQPTR */
#define _ETH_TXQPTR_DMATXQPTR_SHIFT                      2                                    /**< Shift value for ETH_DMATXQPTR */
#define _ETH_TXQPTR_DMATXQPTR_MASK                       0xFFFFFFFCUL                         /**< Bit mask for ETH_DMATXQPTR */
#define _ETH_TXQPTR_DMATXQPTR_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_TXQPTR */
#define ETH_TXQPTR_DMATXQPTR_DEFAULT                     (_ETH_TXQPTR_DMATXQPTR_DEFAULT << 2) /**< Shifted mode DEFAULT for ETH_TXQPTR */

/* Bit fields for ETH RXSTATUS */
#define _ETH_RXSTATUS_RESETVALUE                         0x00000000UL                              /**< Default value for ETH_RXSTATUS */
#define _ETH_RXSTATUS_MASK                               0x0000000FUL                              /**< Mask for ETH_RXSTATUS */
#define ETH_RXSTATUS_BUFFNOTAVAIL                        (0x1UL << 0)                              /**< Buffer not available */
#define _ETH_RXSTATUS_BUFFNOTAVAIL_SHIFT                 0                                         /**< Shift value for ETH_BUFFNOTAVAIL */
#define _ETH_RXSTATUS_BUFFNOTAVAIL_MASK                  0x1UL                                     /**< Bit mask for ETH_BUFFNOTAVAIL */
#define _ETH_RXSTATUS_BUFFNOTAVAIL_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_BUFFNOTAVAIL_DEFAULT                (_ETH_RXSTATUS_BUFFNOTAVAIL_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_FRMRX                               (0x1UL << 1)                              /**< Frame received */
#define _ETH_RXSTATUS_FRMRX_SHIFT                        1                                         /**< Shift value for ETH_FRMRX */
#define _ETH_RXSTATUS_FRMRX_MASK                         0x2UL                                     /**< Bit mask for ETH_FRMRX */
#define _ETH_RXSTATUS_FRMRX_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_FRMRX_DEFAULT                       (_ETH_RXSTATUS_FRMRX_DEFAULT << 1)        /**< Shifted mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_RXOVERRUN                           (0x1UL << 2)                              /**< Receive overrun */
#define _ETH_RXSTATUS_RXOVERRUN_SHIFT                    2                                         /**< Shift value for ETH_RXOVERRUN */
#define _ETH_RXSTATUS_RXOVERRUN_MASK                     0x4UL                                     /**< Bit mask for ETH_RXOVERRUN */
#define _ETH_RXSTATUS_RXOVERRUN_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_RXOVERRUN_DEFAULT                   (_ETH_RXSTATUS_RXOVERRUN_DEFAULT << 2)    /**< Shifted mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_RESPNOTOK                           (0x1UL << 3)                              /**< bresp/hresp not OK */
#define _ETH_RXSTATUS_RESPNOTOK_SHIFT                    3                                         /**< Shift value for ETH_RESPNOTOK */
#define _ETH_RXSTATUS_RESPNOTOK_MASK                     0x8UL                                     /**< Bit mask for ETH_RESPNOTOK */
#define _ETH_RXSTATUS_RESPNOTOK_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for ETH_RXSTATUS */
#define ETH_RXSTATUS_RESPNOTOK_DEFAULT                   (_ETH_RXSTATUS_RESPNOTOK_DEFAULT << 3)    /**< Shifted mode DEFAULT for ETH_RXSTATUS */

