RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH IENC */
#define _ETH_IENC_RESETVALUE                             0x00000000UL                               /**< Default value for ETH_IENC */
#define _ETH_IENC_MASK                                   0x3FFC7CFFUL                               /**< Mask for ETH_IENC */
#define ETH_IENC_MNGMNTDONE                              (0x1UL << 0)                               /**< Disable management done interrupt */
#define _ETH_IENC_MNGMNTDONE_SHIFT                       0                                          /**< Shift value for ETH_MNGMNTDONE */
#define _ETH_IENC_MNGMNTDONE_MASK                        0x1UL                                      /**< Bit mask for ETH_MNGMNTDONE */
#define _ETH_IENC_MNGMNTDONE_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_MNGMNTDONE_DEFAULT                      (_ETH_IENC_MNGMNTDONE_DEFAULT << 0)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXCMPLT                                 (0x1UL << 1)                               /**< Disable receive complete interrupt */
#define _ETH_IENC_RXCMPLT_SHIFT                          1                                          /**< Shift value for ETH_RXCMPLT */
#define _ETH_IENC_RXCMPLT_MASK                           0x2UL                                      /**< Bit mask for ETH_RXCMPLT */
#define _ETH_IENC_RXCMPLT_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXCMPLT_DEFAULT                         (_ETH_IENC_RXCMPLT_DEFAULT << 1)           /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXUSEDBITREAD                           (0x1UL << 2)                               /**< Disable receive used bit read interrupt */
#define _ETH_IENC_RXUSEDBITREAD_SHIFT                    2                                          /**< Shift value for ETH_RXUSEDBITREAD */
#define _ETH_IENC_RXUSEDBITREAD_MASK                     0x4UL                                      /**< Bit mask for ETH_RXUSEDBITREAD */
#define _ETH_IENC_RXUSEDBITREAD_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXUSEDBITREAD_DEFAULT                   (_ETH_IENC_RXUSEDBITREAD_DEFAULT << 2)     /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXUSEDBITREAD                           (0x1UL << 3)                               /**< Disable transmit used bit read interrupt */
#define _ETH_IENC_TXUSEDBITREAD_SHIFT                    3                                          /**< Shift value for ETH_TXUSEDBITREAD */
#define _ETH_IENC_TXUSEDBITREAD_MASK                     0x8UL                                      /**< Bit mask for ETH_TXUSEDBITREAD */
#define _ETH_IENC_TXUSEDBITREAD_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXUSEDBITREAD_DEFAULT                   (_ETH_IENC_TXUSEDBITREAD_DEFAULT << 3)     /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXUNDERRUN                              (0x1UL << 4)                               /**< Disable transmit buffer under run interrupt */
#define _ETH_IENC_TXUNDERRUN_SHIFT                       4                                          /**< Shift value for ETH_TXUNDERRUN */
#define _ETH_IENC_TXUNDERRUN_MASK                        0x10UL                                     /**< Bit mask for ETH_TXUNDERRUN */
#define _ETH_IENC_TXUNDERRUN_DEFAULT                     0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXUNDERRUN_DEFAULT                      (_ETH_IENC_TXUNDERRUN_DEFAULT << 4)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RTRYLMTORLATECOL                        (0x1UL << 5)                               /**< Disable retry limit exceeded or late collision interrupt */
#define _ETH_IENC_RTRYLMTORLATECOL_SHIFT                 5                                          /**< Shift value for ETH_RTRYLMTORLATECOL */
#define _ETH_IENC_RTRYLMTORLATECOL_MASK                  0x20UL                                     /**< Bit mask for ETH_RTRYLMTORLATECOL */
#define _ETH_IENC_RTRYLMTORLATECOL_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RTRYLMTORLATECOL_DEFAULT                (_ETH_IENC_RTRYLMTORLATECOL_DEFAULT << 5)  /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_AMBAERR                                 (0x1UL << 6)                               /**< Disable transmit frame corruption due to AMBA (AHB) error interrupt */
#define _ETH_IENC_AMBAERR_SHIFT                          6                                          /**< Shift value for ETH_AMBAERR */
#define _ETH_IENC_AMBAERR_MASK                           0x40UL                                     /**< Bit mask for ETH_AMBAERR */
#define _ETH_IENC_AMBAERR_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_AMBAERR_DEFAULT                         (_ETH_IENC_AMBAERR_DEFAULT << 6)           /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXCMPLT                                 (0x1UL << 7)                               /**< Disable transmit complete interrupt */
#define _ETH_IENC_TXCMPLT_SHIFT                          7                                          /**< Shift value for ETH_TXCMPLT */
#define _ETH_IENC_TXCMPLT_MASK                           0x80UL                                     /**< Bit mask for ETH_TXCMPLT */
#define _ETH_IENC_TXCMPLT_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_TXCMPLT_DEFAULT                         (_ETH_IENC_TXCMPLT_DEFAULT << 7)           /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXOVERRUN                               (0x1UL << 10)                              /**< Disable receive overrun interrupt */
#define _ETH_IENC_RXOVERRUN_SHIFT                        10                                         /**< Shift value for ETH_RXOVERRUN */
#define _ETH_IENC_RXOVERRUN_MASK                         0x400UL                                    /**< Bit mask for ETH_RXOVERRUN */
#define _ETH_IENC_RXOVERRUN_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXOVERRUN_DEFAULT                       (_ETH_IENC_RXOVERRUN_DEFAULT << 10)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RESPNOTOK                               (0x1UL << 11)                              /**< Disable bresp/hresp not OK interrupt */
#define _ETH_IENC_RESPNOTOK_SHIFT                        11                                         /**< Shift value for ETH_RESPNOTOK */
#define _ETH_IENC_RESPNOTOK_MASK                         0x800UL                                    /**< Bit mask for ETH_RESPNOTOK */
#define _ETH_IENC_RESPNOTOK_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RESPNOTOK_DEFAULT                       (_ETH_IENC_RESPNOTOK_DEFAULT << 11)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_NONZEROPFRMQUANT                        (0x1UL << 12)                              /**< Disable pause frame with non-zero pause quantum interrupt */
#define _ETH_IENC_NONZEROPFRMQUANT_SHIFT                 12                                         /**< Shift value for ETH_NONZEROPFRMQUANT */
#define _ETH_IENC_NONZEROPFRMQUANT_MASK                  0x1000UL                                   /**< Bit mask for ETH_NONZEROPFRMQUANT */
#define _ETH_IENC_NONZEROPFRMQUANT_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_NONZEROPFRMQUANT_DEFAULT                (_ETH_IENC_NONZEROPFRMQUANT_DEFAULT << 12) /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PAUSETIMEZERO                           (0x1UL << 13)                              /**< Disable pause time zero interrupt */
#define _ETH_IENC_PAUSETIMEZERO_SHIFT                    13                                         /**< Shift value for ETH_PAUSETIMEZERO */
#define _ETH_IENC_PAUSETIMEZERO_MASK                     0x2000UL                                   /**< Bit mask for ETH_PAUSETIMEZERO */
#define _ETH_IENC_PAUSETIMEZERO_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PAUSETIMEZERO_DEFAULT                   (_ETH_IENC_PAUSETIMEZERO_DEFAULT << 13)    /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PFRMTX                                  (0x1UL << 14)                              /**< Disable pause frame transmitted interrupt */
#define _ETH_IENC_PFRMTX_SHIFT                           14                                         /**< Shift value for ETH_PFRMTX */
#define _ETH_IENC_PFRMTX_MASK                            0x4000UL                                   /**< Bit mask for ETH_PFRMTX */
#define _ETH_IENC_PFRMTX_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PFRMTX_DEFAULT                          (_ETH_IENC_PFRMTX_DEFAULT << 14)           /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPDLYREQFRMRX                          (0x1UL << 18)                              /**< Disable PTP delay_req frame received interrupt */
#define _ETH_IENC_PTPDLYREQFRMRX_SHIFT                   18                                         /**< Shift value for ETH_PTPDLYREQFRMRX */
#define _ETH_IENC_PTPDLYREQFRMRX_MASK                    0x40000UL                                  /**< Bit mask for ETH_PTPDLYREQFRMRX */
#define _ETH_IENC_PTPDLYREQFRMRX_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPDLYREQFRMRX_DEFAULT                  (_ETH_IENC_PTPDLYREQFRMRX_DEFAULT << 18)   /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPSYNCFRMRX                            (0x1UL << 19)                              /**< Disable PTP sync frame received interrupt */
#define _ETH_IENC_PTPSYNCFRMRX_SHIFT                     19                                         /**< Shift value for ETH_PTPSYNCFRMRX */
#define _ETH_IENC_PTPSYNCFRMRX_MASK                      0x80000UL                                  /**< Bit mask for ETH_PTPSYNCFRMRX */
#define _ETH_IENC_PTPSYNCFRMRX_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPSYNCFRMRX_DEFAULT                    (_ETH_IENC_PTPSYNCFRMRX_DEFAULT << 19)     /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPDLYREQFRMTX                          (0x1UL << 20)                              /**< Disable PTP delay_req frame transmitted interrupt  */
#define _ETH_IENC_PTPDLYREQFRMTX_SHIFT                   20                                         /**< Shift value for ETH_PTPDLYREQFRMTX */
#define _ETH_IENC_PTPDLYREQFRMTX_MASK                    0x100000UL                                 /**< Bit mask for ETH_PTPDLYREQFRMTX */
#define _ETH_IENC_PTPDLYREQFRMTX_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPDLYREQFRMTX_DEFAULT                  (_ETH_IENC_PTPDLYREQFRMTX_DEFAULT << 20)   /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPSYNCFRMTX                            (0x1UL << 21)                              /**< Disable PTP sync frame transmitted interrupt  */
#define _ETH_IENC_PTPSYNCFRMTX_SHIFT                     21                                         /**< Shift value for ETH_PTPSYNCFRMTX */
#define _ETH_IENC_PTPSYNCFRMTX_MASK                      0x200000UL                                 /**< Bit mask for ETH_PTPSYNCFRMTX */
#define _ETH_IENC_PTPSYNCFRMTX_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPSYNCFRMTX_DEFAULT                    (_ETH_IENC_PTPSYNCFRMTX_DEFAULT << 21)     /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYREQFRMRX                         (0x1UL << 22)                              /**< Disable PTP pdelay_req frame received interrupt */
#define _ETH_IENC_PTPPDLYREQFRMRX_SHIFT                  22                                         /**< Shift value for ETH_PTPPDLYREQFRMRX */
#define _ETH_IENC_PTPPDLYREQFRMRX_MASK                   0x400000UL                                 /**< Bit mask for ETH_PTPPDLYREQFRMRX */
#define _ETH_IENC_PTPPDLYREQFRMRX_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYREQFRMRX_DEFAULT                 (_ETH_IENC_PTPPDLYREQFRMRX_DEFAULT << 22)  /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYRESPFRMRX                        (0x1UL << 23)                              /**< Disable PTP pdelay_resp frame received interrupt */
#define _ETH_IENC_PTPPDLYRESPFRMRX_SHIFT                 23                                         /**< Shift value for ETH_PTPPDLYRESPFRMRX */
#define _ETH_IENC_PTPPDLYRESPFRMRX_MASK                  0x800000UL                                 /**< Bit mask for ETH_PTPPDLYRESPFRMRX */
#define _ETH_IENC_PTPPDLYRESPFRMRX_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYRESPFRMRX_DEFAULT                (_ETH_IENC_PTPPDLYRESPFRMRX_DEFAULT << 23) /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYREQFRMTX                         (0x1UL << 24)                              /**< Disable PTP pdelay_req frame transmitted interrupt */
#define _ETH_IENC_PTPPDLYREQFRMTX_SHIFT                  24                                         /**< Shift value for ETH_PTPPDLYREQFRMTX */
#define _ETH_IENC_PTPPDLYREQFRMTX_MASK                   0x1000000UL                                /**< Bit mask for ETH_PTPPDLYREQFRMTX */
#define _ETH_IENC_PTPPDLYREQFRMTX_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYREQFRMTX_DEFAULT                 (_ETH_IENC_PTPPDLYREQFRMTX_DEFAULT << 24)  /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYRESPFRMTX                        (0x1UL << 25)                              /**< Disable PTP pdelay_resp frame transmitted interrupt */
#define _ETH_IENC_PTPPDLYRESPFRMTX_SHIFT                 25                                         /**< Shift value for ETH_PTPPDLYRESPFRMTX */
#define _ETH_IENC_PTPPDLYRESPFRMTX_MASK                  0x2000000UL                                /**< Bit mask for ETH_PTPPDLYRESPFRMTX */
#define _ETH_IENC_PTPPDLYRESPFRMTX_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_PTPPDLYRESPFRMTX_DEFAULT                (_ETH_IENC_PTPPDLYRESPFRMTX_DEFAULT << 25) /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_TSUSECREGINCR                           (0x1UL << 26)                              /**< Disable TSU seconds register increment interrupt */
#define _ETH_IENC_TSUSECREGINCR_SHIFT                    26                                         /**< Shift value for ETH_TSUSECREGINCR */
#define _ETH_IENC_TSUSECREGINCR_MASK                     0x4000000UL                                /**< Bit mask for ETH_TSUSECREGINCR */
#define _ETH_IENC_TSUSECREGINCR_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_TSUSECREGINCR_DEFAULT                   (_ETH_IENC_TSUSECREGINCR_DEFAULT << 26)    /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXLPIINDC                               (0x1UL << 27)                              /**< Disable RX LPI indication interrupt */
#define _ETH_IENC_RXLPIINDC_SHIFT                        27                                         /**< Shift value for ETH_RXLPIINDC */
#define _ETH_IENC_RXLPIINDC_MASK                         0x8000000UL                                /**< Bit mask for ETH_RXLPIINDC */
#define _ETH_IENC_RXLPIINDC_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_RXLPIINDC_DEFAULT                       (_ETH_IENC_RXLPIINDC_DEFAULT << 27)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_WOLEVNTRX                               (0x1UL << 28)                              /**< Disable WOL event received interrupt */
#define _ETH_IENC_WOLEVNTRX_SHIFT                        28                                         /**< Shift value for ETH_WOLEVNTRX */
#define _ETH_IENC_WOLEVNTRX_MASK                         0x10000000UL                               /**< Bit mask for ETH_WOLEVNTRX */
#define _ETH_IENC_WOLEVNTRX_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_WOLEVNTRX_DEFAULT                       (_ETH_IENC_WOLEVNTRX_DEFAULT << 28)        /**< Shifted mode DEFAULT for ETH_IENC */
#define ETH_IENC_TSUTIMERCOMP                            (0x1UL << 29)                              /**< Disable TSU timer comparison interrupt. */
#define _ETH_IENC_TSUTIMERCOMP_SHIFT                     29                                         /**< Shift value for ETH_TSUTIMERCOMP */
#define _ETH_IENC_TSUTIMERCOMP_MASK                      0x20000000UL                               /**< Bit mask for ETH_TSUTIMERCOMP */
#define _ETH_IENC_TSUTIMERCOMP_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for ETH_IENC */
#define ETH_IENC_TSUTIMERCOMP_DEFAULT                    (_ETH_IENC_TSUTIMERCOMP_DEFAULT << 29)     /**< Shifted mode DEFAULT for ETH_IENC */

