RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH BROADCASTTXED */
#define _ETH_BROADCASTTXED_RESETVALUE                    0x00000000UL                            /**< Default value for ETH_BROADCASTTXED */
#define _ETH_BROADCASTTXED_MASK                          0xFFFFFFFFUL                            /**< Mask for ETH_BROADCASTTXED */
#define _ETH_BROADCASTTXED_COUNT_SHIFT                   0                                       /**< Shift value for ETH_COUNT */
#define _ETH_BROADCASTTXED_COUNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_BROADCASTTXED_COUNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_BROADCASTTXED */
#define ETH_BROADCASTTXED_COUNT_DEFAULT                  (_ETH_BROADCASTTXED_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_BROADCASTTXED */

/* Bit fields for ETH MULTICASTTXED */
#define _ETH_MULTICASTTXED_RESETVALUE                    0x00000000UL                            /**< Default value for ETH_MULTICASTTXED */
#define _ETH_MULTICASTTXED_MASK                          0xFFFFFFFFUL                            /**< Mask for ETH_MULTICASTTXED */
#define _ETH_MULTICASTTXED_COUNT_SHIFT                   0                                       /**< Shift value for ETH_COUNT */
#define _ETH_MULTICASTTXED_COUNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_MULTICASTTXED_COUNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_MULTICASTTXED */
#define ETH_MULTICASTTXED_COUNT_DEFAULT                  (_ETH_MULTICASTTXED_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_MULTICASTTXED */

/* Bit fields for ETH PFRAMESTXED */
#define _ETH_PFRAMESTXED_RESETVALUE                      0x00000000UL                          /**< Default value for ETH_PFRAMESTXED */
#define _ETH_PFRAMESTXED_MASK                            0x0000FFFFUL                          /**< Mask for ETH_PFRAMESTXED */
#define _ETH_PFRAMESTXED_COUNT_SHIFT                     0                                     /**< Shift value for ETH_COUNT */
#define _ETH_PFRAMESTXED_COUNT_MASK                      0xFFFFUL                              /**< Bit mask for ETH_COUNT */
#define _ETH_PFRAMESTXED_COUNT_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_PFRAMESTXED */
#define ETH_PFRAMESTXED_COUNT_DEFAULT                    (_ETH_PFRAMESTXED_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_PFRAMESTXED */

/* Bit fields for ETH FRAMESTXED64 */
#define _ETH_FRAMESTXED64_RESETVALUE                     0x00000000UL                           /**< Default value for ETH_FRAMESTXED64 */
#define _ETH_FRAMESTXED64_MASK                           0xFFFFFFFFUL                           /**< Mask for ETH_FRAMESTXED64 */
#define _ETH_FRAMESTXED64_COUNT_SHIFT                    0                                      /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED64_COUNT_MASK                     0xFFFFFFFFUL                           /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED64_COUNT_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for ETH_FRAMESTXED64 */
#define ETH_FRAMESTXED64_COUNT_DEFAULT                   (_ETH_FRAMESTXED64_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED64 */

/* Bit fields for ETH FRAMESTXED65 */
#define _ETH_FRAMESTXED65_RESETVALUE                     0x00000000UL                           /**< Default value for ETH_FRAMESTXED65 */
#define _ETH_FRAMESTXED65_MASK                           0xFFFFFFFFUL                           /**< Mask for ETH_FRAMESTXED65 */
#define _ETH_FRAMESTXED65_COUNT_SHIFT                    0                                      /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED65_COUNT_MASK                     0xFFFFFFFFUL                           /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED65_COUNT_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for ETH_FRAMESTXED65 */
#define ETH_FRAMESTXED65_COUNT_DEFAULT                   (_ETH_FRAMESTXED65_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED65 */

/* Bit fields for ETH FRAMESTXED128 */
#define _ETH_FRAMESTXED128_RESETVALUE                    0x00000000UL                            /**< Default value for ETH_FRAMESTXED128 */
#define _ETH_FRAMESTXED128_MASK                          0xFFFFFFFFUL                            /**< Mask for ETH_FRAMESTXED128 */
#define _ETH_FRAMESTXED128_COUNT_SHIFT                   0                                       /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED128_COUNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED128_COUNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_FRAMESTXED128 */
#define ETH_FRAMESTXED128_COUNT_DEFAULT                  (_ETH_FRAMESTXED128_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED128 */

/* Bit fields for ETH FRAMESTXED256 */
#define _ETH_FRAMESTXED256_RESETVALUE                    0x00000000UL                            /**< Default value for ETH_FRAMESTXED256 */
#define _ETH_FRAMESTXED256_MASK                          0xFFFFFFFFUL                            /**< Mask for ETH_FRAMESTXED256 */
#define _ETH_FRAMESTXED256_COUNT_SHIFT                   0                                       /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED256_COUNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED256_COUNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_FRAMESTXED256 */
#define ETH_FRAMESTXED256_COUNT_DEFAULT                  (_ETH_FRAMESTXED256_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED256 */

/* Bit fields for ETH FRAMESTXED512 */
#define _ETH_FRAMESTXED512_RESETVALUE                    0x00000000UL                            /**< Default value for ETH_FRAMESTXED512 */
#define _ETH_FRAMESTXED512_MASK                          0xFFFFFFFFUL                            /**< Mask for ETH_FRAMESTXED512 */
#define _ETH_FRAMESTXED512_COUNT_SHIFT                   0                                       /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED512_COUNT_MASK                    0xFFFFFFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED512_COUNT_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_FRAMESTXED512 */
#define ETH_FRAMESTXED512_COUNT_DEFAULT                  (_ETH_FRAMESTXED512_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED512 */

/* Bit fields for ETH FRAMESTXED1024 */
#define _ETH_FRAMESTXED1024_RESETVALUE                   0x00000000UL                             /**< Default value for ETH_FRAMESTXED1024 */
#define _ETH_FRAMESTXED1024_MASK                         0xFFFFFFFFUL                             /**< Mask for ETH_FRAMESTXED1024 */
#define _ETH_FRAMESTXED1024_COUNT_SHIFT                  0                                        /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED1024_COUNT_MASK                   0xFFFFFFFFUL                             /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED1024_COUNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for ETH_FRAMESTXED1024 */
#define ETH_FRAMESTXED1024_COUNT_DEFAULT                 (_ETH_FRAMESTXED1024_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED1024 */

