RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH FRAMESTXED1519 */
#define _ETH_FRAMESTXED1519_RESETVALUE                   0x00000000UL                             /**< Default value for ETH_FRAMESTXED1519 */
#define _ETH_FRAMESTXED1519_MASK                         0xFFFFFFFFUL                             /**< Mask for ETH_FRAMESTXED1519 */
#define _ETH_FRAMESTXED1519_COUNT_SHIFT                  0                                        /**< Shift value for ETH_COUNT */
#define _ETH_FRAMESTXED1519_COUNT_MASK                   0xFFFFFFFFUL                             /**< Bit mask for ETH_COUNT */
#define _ETH_FRAMESTXED1519_COUNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for ETH_FRAMESTXED1519 */
#define ETH_FRAMESTXED1519_COUNT_DEFAULT                 (_ETH_FRAMESTXED1519_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FRAMESTXED1519 */

/* Bit fields for ETH TXUNDERRUNS */
#define _ETH_TXUNDERRUNS_RESETVALUE                      0x00000000UL                          /**< Default value for ETH_TXUNDERRUNS */
#define _ETH_TXUNDERRUNS_MASK                            0x000003FFUL                          /**< Mask for ETH_TXUNDERRUNS */
#define _ETH_TXUNDERRUNS_COUNT_SHIFT                     0                                     /**< Shift value for ETH_COUNT */
#define _ETH_TXUNDERRUNS_COUNT_MASK                      0x3FFUL                               /**< Bit mask for ETH_COUNT */
#define _ETH_TXUNDERRUNS_COUNT_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_TXUNDERRUNS */
#define ETH_TXUNDERRUNS_COUNT_DEFAULT                    (_ETH_TXUNDERRUNS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_TXUNDERRUNS */

/* Bit fields for ETH SINGLECOLS */
#define _ETH_SINGLECOLS_RESETVALUE                       0x00000000UL                         /**< Default value for ETH_SINGLECOLS */
#define _ETH_SINGLECOLS_MASK                             0x0003FFFFUL                         /**< Mask for ETH_SINGLECOLS */
#define _ETH_SINGLECOLS_COUNT_SHIFT                      0                                    /**< Shift value for ETH_COUNT */
#define _ETH_SINGLECOLS_COUNT_MASK                       0x3FFFFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_SINGLECOLS_COUNT_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_SINGLECOLS */
#define ETH_SINGLECOLS_COUNT_DEFAULT                     (_ETH_SINGLECOLS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_SINGLECOLS */

/* Bit fields for ETH MULTICOLS */
#define _ETH_MULTICOLS_RESETVALUE                        0x00000000UL                        /**< Default value for ETH_MULTICOLS */
#define _ETH_MULTICOLS_MASK                              0x0003FFFFUL                        /**< Mask for ETH_MULTICOLS */
#define _ETH_MULTICOLS_COUNT_SHIFT                       0                                   /**< Shift value for ETH_COUNT */
#define _ETH_MULTICOLS_COUNT_MASK                        0x3FFFFUL                           /**< Bit mask for ETH_COUNT */
#define _ETH_MULTICOLS_COUNT_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for ETH_MULTICOLS */
#define ETH_MULTICOLS_COUNT_DEFAULT                      (_ETH_MULTICOLS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_MULTICOLS */

/* Bit fields for ETH EXCESSCOLS */
#define _ETH_EXCESSCOLS_RESETVALUE                       0x00000000UL                         /**< Default value for ETH_EXCESSCOLS */
#define _ETH_EXCESSCOLS_MASK                             0x000003FFUL                         /**< Mask for ETH_EXCESSCOLS */
#define _ETH_EXCESSCOLS_COUNT_SHIFT                      0                                    /**< Shift value for ETH_COUNT */
#define _ETH_EXCESSCOLS_COUNT_MASK                       0x3FFUL                              /**< Bit mask for ETH_COUNT */
#define _ETH_EXCESSCOLS_COUNT_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_EXCESSCOLS */
#define ETH_EXCESSCOLS_COUNT_DEFAULT                     (_ETH_EXCESSCOLS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_EXCESSCOLS */

/* Bit fields for ETH LATECOLS */
#define _ETH_LATECOLS_RESETVALUE                         0x00000000UL                       /**< Default value for ETH_LATECOLS */
#define _ETH_LATECOLS_MASK                               0x000003FFUL                       /**< Mask for ETH_LATECOLS */
#define _ETH_LATECOLS_COUNT_SHIFT                        0                                  /**< Shift value for ETH_COUNT */
#define _ETH_LATECOLS_COUNT_MASK                         0x3FFUL                            /**< Bit mask for ETH_COUNT */
#define _ETH_LATECOLS_COUNT_DEFAULT                      0x00000000UL                       /**< Mode DEFAULT for ETH_LATECOLS */
#define ETH_LATECOLS_COUNT_DEFAULT                       (_ETH_LATECOLS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_LATECOLS */

/* Bit fields for ETH DEFERREDFRAMES */
#define _ETH_DEFERREDFRAMES_RESETVALUE                   0x00000000UL                             /**< Default value for ETH_DEFERREDFRAMES */
#define _ETH_DEFERREDFRAMES_MASK                         0x0003FFFFUL                             /**< Mask for ETH_DEFERREDFRAMES */
#define _ETH_DEFERREDFRAMES_COUNT_SHIFT                  0                                        /**< Shift value for ETH_COUNT */
#define _ETH_DEFERREDFRAMES_COUNT_MASK                   0x3FFFFUL                                /**< Bit mask for ETH_COUNT */
#define _ETH_DEFERREDFRAMES_COUNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for ETH_DEFERREDFRAMES */
#define ETH_DEFERREDFRAMES_COUNT_DEFAULT                 (_ETH_DEFERREDFRAMES_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_DEFERREDFRAMES */

/* Bit fields for ETH CRSERRS */
#define _ETH_CRSERRS_RESETVALUE                          0x00000000UL                      /**< Default value for ETH_CRSERRS */
#define _ETH_CRSERRS_MASK                                0x000003FFUL                      /**< Mask for ETH_CRSERRS */
#define _ETH_CRSERRS_COUNT_SHIFT                         0                                 /**< Shift value for ETH_COUNT */
#define _ETH_CRSERRS_COUNT_MASK                          0x3FFUL                           /**< Bit mask for ETH_COUNT */
#define _ETH_CRSERRS_COUNT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for ETH_CRSERRS */
#define ETH_CRSERRS_COUNT_DEFAULT                        (_ETH_CRSERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_CRSERRS */

