RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH RXJABBERS */
#define _ETH_RXJABBERS_RESETVALUE                        0x00000000UL                        /**< Default value for ETH_RXJABBERS */
#define _ETH_RXJABBERS_MASK                              0x000003FFUL                        /**< Mask for ETH_RXJABBERS */
#define _ETH_RXJABBERS_COUNT_SHIFT                       0                                   /**< Shift value for ETH_COUNT */
#define _ETH_RXJABBERS_COUNT_MASK                        0x3FFUL                             /**< Bit mask for ETH_COUNT */
#define _ETH_RXJABBERS_COUNT_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for ETH_RXJABBERS */
#define ETH_RXJABBERS_COUNT_DEFAULT                      (_ETH_RXJABBERS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXJABBERS */

/* Bit fields for ETH FCSERRS */
#define _ETH_FCSERRS_RESETVALUE                          0x00000000UL                      /**< Default value for ETH_FCSERRS */
#define _ETH_FCSERRS_MASK                                0x000003FFUL                      /**< Mask for ETH_FCSERRS */
#define _ETH_FCSERRS_COUNT_SHIFT                         0                                 /**< Shift value for ETH_COUNT */
#define _ETH_FCSERRS_COUNT_MASK                          0x3FFUL                           /**< Bit mask for ETH_COUNT */
#define _ETH_FCSERRS_COUNT_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for ETH_FCSERRS */
#define ETH_FCSERRS_COUNT_DEFAULT                        (_ETH_FCSERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_FCSERRS */

/* Bit fields for ETH RXLENERRS */
#define _ETH_RXLENERRS_RESETVALUE                        0x00000000UL                        /**< Default value for ETH_RXLENERRS */
#define _ETH_RXLENERRS_MASK                              0x000003FFUL                        /**< Mask for ETH_RXLENERRS */
#define _ETH_RXLENERRS_COUNT_SHIFT                       0                                   /**< Shift value for ETH_COUNT */
#define _ETH_RXLENERRS_COUNT_MASK                        0x3FFUL                             /**< Bit mask for ETH_COUNT */
#define _ETH_RXLENERRS_COUNT_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for ETH_RXLENERRS */
#define ETH_RXLENERRS_COUNT_DEFAULT                      (_ETH_RXLENERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXLENERRS */

/* Bit fields for ETH RXSYMBOLERRS */
#define _ETH_RXSYMBOLERRS_RESETVALUE                     0x00000000UL                           /**< Default value for ETH_RXSYMBOLERRS */
#define _ETH_RXSYMBOLERRS_MASK                           0x000003FFUL                           /**< Mask for ETH_RXSYMBOLERRS */
#define _ETH_RXSYMBOLERRS_COUNT_SHIFT                    0                                      /**< Shift value for ETH_COUNT */
#define _ETH_RXSYMBOLERRS_COUNT_MASK                     0x3FFUL                                /**< Bit mask for ETH_COUNT */
#define _ETH_RXSYMBOLERRS_COUNT_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for ETH_RXSYMBOLERRS */
#define ETH_RXSYMBOLERRS_COUNT_DEFAULT                   (_ETH_RXSYMBOLERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXSYMBOLERRS */

/* Bit fields for ETH ALIGNERRS */
#define _ETH_ALIGNERRS_RESETVALUE                        0x00000000UL                        /**< Default value for ETH_ALIGNERRS */
#define _ETH_ALIGNERRS_MASK                              0x000003FFUL                        /**< Mask for ETH_ALIGNERRS */
#define _ETH_ALIGNERRS_COUNT_SHIFT                       0                                   /**< Shift value for ETH_COUNT */
#define _ETH_ALIGNERRS_COUNT_MASK                        0x3FFUL                             /**< Bit mask for ETH_COUNT */
#define _ETH_ALIGNERRS_COUNT_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for ETH_ALIGNERRS */
#define ETH_ALIGNERRS_COUNT_DEFAULT                      (_ETH_ALIGNERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_ALIGNERRS */

/* Bit fields for ETH RXRESOURCEERRS */
#define _ETH_RXRESOURCEERRS_RESETVALUE                   0x00000000UL                             /**< Default value for ETH_RXRESOURCEERRS */
#define _ETH_RXRESOURCEERRS_MASK                         0x0003FFFFUL                             /**< Mask for ETH_RXRESOURCEERRS */
#define _ETH_RXRESOURCEERRS_COUNT_SHIFT                  0                                        /**< Shift value for ETH_COUNT */
#define _ETH_RXRESOURCEERRS_COUNT_MASK                   0x3FFFFUL                                /**< Bit mask for ETH_COUNT */
#define _ETH_RXRESOURCEERRS_COUNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for ETH_RXRESOURCEERRS */
#define ETH_RXRESOURCEERRS_COUNT_DEFAULT                 (_ETH_RXRESOURCEERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXRESOURCEERRS */

/* Bit fields for ETH RXOVERRUNS */
#define _ETH_RXOVERRUNS_RESETVALUE                       0x00000000UL                         /**< Default value for ETH_RXOVERRUNS */
#define _ETH_RXOVERRUNS_MASK                             0x000003FFUL                         /**< Mask for ETH_RXOVERRUNS */
#define _ETH_RXOVERRUNS_COUNT_SHIFT                      0                                    /**< Shift value for ETH_COUNT */
#define _ETH_RXOVERRUNS_COUNT_MASK                       0x3FFUL                              /**< Bit mask for ETH_COUNT */
#define _ETH_RXOVERRUNS_COUNT_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_RXOVERRUNS */
#define ETH_RXOVERRUNS_COUNT_DEFAULT                     (_ETH_RXOVERRUNS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXOVERRUNS */

/* Bit fields for ETH RXIPCKERRS */
#define _ETH_RXIPCKERRS_RESETVALUE                       0x00000000UL                         /**< Default value for ETH_RXIPCKERRS */
#define _ETH_RXIPCKERRS_MASK                             0x000000FFUL                         /**< Mask for ETH_RXIPCKERRS */
#define _ETH_RXIPCKERRS_COUNT_SHIFT                      0                                    /**< Shift value for ETH_COUNT */
#define _ETH_RXIPCKERRS_COUNT_MASK                       0xFFUL                               /**< Bit mask for ETH_COUNT */
#define _ETH_RXIPCKERRS_COUNT_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for ETH_RXIPCKERRS */
#define ETH_RXIPCKERRS_COUNT_DEFAULT                     (_ETH_RXIPCKERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXIPCKERRS */

/* Bit fields for ETH RXTCPCKERRS */
#define _ETH_RXTCPCKERRS_RESETVALUE                      0x00000000UL                          /**< Default value for ETH_RXTCPCKERRS */
#define _ETH_RXTCPCKERRS_MASK                            0x000000FFUL                          /**< Mask for ETH_RXTCPCKERRS */
#define _ETH_RXTCPCKERRS_COUNT_SHIFT                     0                                     /**< Shift value for ETH_COUNT */
#define _ETH_RXTCPCKERRS_COUNT_MASK                      0xFFUL                                /**< Bit mask for ETH_COUNT */
#define _ETH_RXTCPCKERRS_COUNT_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_RXTCPCKERRS */
#define ETH_RXTCPCKERRS_COUNT_DEFAULT                    (_ETH_RXTCPCKERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXTCPCKERRS */

/* Bit fields for ETH RXUDPCKERRS */
#define _ETH_RXUDPCKERRS_RESETVALUE                      0x00000000UL                          /**< Default value for ETH_RXUDPCKERRS */
#define _ETH_RXUDPCKERRS_MASK                            0x000000FFUL                          /**< Mask for ETH_RXUDPCKERRS */
#define _ETH_RXUDPCKERRS_COUNT_SHIFT                     0                                     /**< Shift value for ETH_COUNT */
#define _ETH_RXUDPCKERRS_COUNT_MASK                      0xFFUL                                /**< Bit mask for ETH_COUNT */
#define _ETH_RXUDPCKERRS_COUNT_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_RXUDPCKERRS */
#define ETH_RXUDPCKERRS_COUNT_DEFAULT                    (_ETH_RXUDPCKERRS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXUDPCKERRS */

/* Bit fields for ETH AUTOFLUSHEDPKTS */
#define _ETH_AUTOFLUSHEDPKTS_RESETVALUE                  0x00000000UL                              /**< Default value for ETH_AUTOFLUSHEDPKTS */
#define _ETH_AUTOFLUSHEDPKTS_MASK                        0x0000FFFFUL                              /**< Mask for ETH_AUTOFLUSHEDPKTS */
#define _ETH_AUTOFLUSHEDPKTS_COUNT_SHIFT                 0                                         /**< Shift value for ETH_COUNT */
#define _ETH_AUTOFLUSHEDPKTS_COUNT_MASK                  0xFFFFUL                                  /**< Bit mask for ETH_COUNT */
#define _ETH_AUTOFLUSHEDPKTS_COUNT_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ETH_AUTOFLUSHEDPKTS */
#define ETH_AUTOFLUSHEDPKTS_COUNT_DEFAULT                (_ETH_AUTOFLUSHEDPKTS_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_AUTOFLUSHEDPKTS */

/* Bit fields for ETH TSUTIMERINCRSUBNSEC */
#define _ETH_TSUTIMERINCRSUBNSEC_RESETVALUE              0x00000000UL                                          /**< Default value for ETH_TSUTIMERINCRSUBNSEC */
#define _ETH_TSUTIMERINCRSUBNSEC_MASK                    0xFF00FFFFUL                                          /**< Mask for ETH_TSUTIMERINCRSUBNSEC */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCR_SHIFT         0                                                     /**< Shift value for ETH_SUBNSINCR */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCR_MASK          0xFFFFUL                                              /**< Bit mask for ETH_SUBNSINCR */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCR_DEFAULT       0x00000000UL                                          /**< Mode DEFAULT for ETH_TSUTIMERINCRSUBNSEC */
#define ETH_TSUTIMERINCRSUBNSEC_SUBNSINCR_DEFAULT        (_ETH_TSUTIMERINCRSUBNSEC_SUBNSINCR_DEFAULT << 0)     /**< Shifted mode DEFAULT for ETH_TSUTIMERINCRSUBNSEC */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCRLSB_SHIFT      24                                                    /**< Shift value for ETH_SUBNSINCRLSB */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCRLSB_MASK       0xFF000000UL                                          /**< Bit mask for ETH_SUBNSINCRLSB */
#define _ETH_TSUTIMERINCRSUBNSEC_SUBNSINCRLSB_DEFAULT    0x00000000UL                                          /**< Mode DEFAULT for ETH_TSUTIMERINCRSUBNSEC */
#define ETH_TSUTIMERINCRSUBNSEC_SUBNSINCRLSB_DEFAULT     (_ETH_TSUTIMERINCRSUBNSEC_SUBNSINCRLSB_DEFAULT << 24) /**< Shifted mode DEFAULT for ETH_TSUTIMERINCRSUBNSEC */

