RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH TXPAUSEQUANT3 */
#define _ETH_TXPAUSEQUANT3_RESETVALUE                    0xFFFFFFFFUL                               /**< Default value for ETH_TXPAUSEQUANT3 */
#define _ETH_TXPAUSEQUANT3_MASK                          0xFFFFFFFFUL                               /**< Mask for ETH_TXPAUSEQUANT3 */
#define _ETH_TXPAUSEQUANT3_QUANTP6_SHIFT                 0                                          /**< Shift value for ETH_QUANTP6 */
#define _ETH_TXPAUSEQUANT3_QUANTP6_MASK                  0xFFFFUL                                   /**< Bit mask for ETH_QUANTP6 */
#define _ETH_TXPAUSEQUANT3_QUANTP6_DEFAULT               0x0000FFFFUL                               /**< Mode DEFAULT for ETH_TXPAUSEQUANT3 */
#define ETH_TXPAUSEQUANT3_QUANTP6_DEFAULT                (_ETH_TXPAUSEQUANT3_QUANTP6_DEFAULT << 0)  /**< Shifted mode DEFAULT for ETH_TXPAUSEQUANT3 */
#define _ETH_TXPAUSEQUANT3_QUANTP7_SHIFT                 16                                         /**< Shift value for ETH_QUANTP7 */
#define _ETH_TXPAUSEQUANT3_QUANTP7_MASK                  0xFFFF0000UL                               /**< Bit mask for ETH_QUANTP7 */
#define _ETH_TXPAUSEQUANT3_QUANTP7_DEFAULT               0x0000FFFFUL                               /**< Mode DEFAULT for ETH_TXPAUSEQUANT3 */
#define ETH_TXPAUSEQUANT3_QUANTP7_DEFAULT                (_ETH_TXPAUSEQUANT3_QUANTP7_DEFAULT << 16) /**< Shifted mode DEFAULT for ETH_TXPAUSEQUANT3 */

/* Bit fields for ETH RXLPI */
#define _ETH_RXLPI_RESETVALUE                            0x00000000UL                    /**< Default value for ETH_RXLPI */
#define _ETH_RXLPI_MASK                                  0x0000FFFFUL                    /**< Mask for ETH_RXLPI */
#define _ETH_RXLPI_COUNT_SHIFT                           0                               /**< Shift value for ETH_COUNT */
#define _ETH_RXLPI_COUNT_MASK                            0xFFFFUL                        /**< Bit mask for ETH_COUNT */
#define _ETH_RXLPI_COUNT_DEFAULT                         0x00000000UL                    /**< Mode DEFAULT for ETH_RXLPI */
#define ETH_RXLPI_COUNT_DEFAULT                          (_ETH_RXLPI_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXLPI */

/* Bit fields for ETH RXLPITIME */
#define _ETH_RXLPITIME_RESETVALUE                        0x00000000UL                          /**< Default value for ETH_RXLPITIME */
#define _ETH_RXLPITIME_MASK                              0x00FFFFFFUL                          /**< Mask for ETH_RXLPITIME */
#define _ETH_RXLPITIME_LPITIME_SHIFT                     0                                     /**< Shift value for ETH_LPITIME */
#define _ETH_RXLPITIME_LPITIME_MASK                      0xFFFFFFUL                            /**< Bit mask for ETH_LPITIME */
#define _ETH_RXLPITIME_LPITIME_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_RXLPITIME */
#define ETH_RXLPITIME_LPITIME_DEFAULT                    (_ETH_RXLPITIME_LPITIME_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_RXLPITIME */

/* Bit fields for ETH TXLPI */
#define _ETH_TXLPI_RESETVALUE                            0x00000000UL                    /**< Default value for ETH_TXLPI */
#define _ETH_TXLPI_MASK                                  0x0000FFFFUL                    /**< Mask for ETH_TXLPI */
#define _ETH_TXLPI_COUNT_SHIFT                           0                               /**< Shift value for ETH_COUNT */
#define _ETH_TXLPI_COUNT_MASK                            0xFFFFUL                        /**< Bit mask for ETH_COUNT */
#define _ETH_TXLPI_COUNT_DEFAULT                         0x00000000UL                    /**< Mode DEFAULT for ETH_TXLPI */
#define ETH_TXLPI_COUNT_DEFAULT                          (_ETH_TXLPI_COUNT_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_TXLPI */

/* Bit fields for ETH TXLPITIME */
#define _ETH_TXLPITIME_RESETVALUE                        0x00000000UL                          /**< Default value for ETH_TXLPITIME */
#define _ETH_TXLPITIME_MASK                              0x00FFFFFFUL                          /**< Mask for ETH_TXLPITIME */
#define _ETH_TXLPITIME_LPITIME_SHIFT                     0                                     /**< Shift value for ETH_LPITIME */
#define _ETH_TXLPITIME_LPITIME_MASK                      0xFFFFFFUL                            /**< Bit mask for ETH_LPITIME */
#define _ETH_TXLPITIME_LPITIME_DEFAULT                   0x00000000UL                          /**< Mode DEFAULT for ETH_TXLPITIME */
#define ETH_TXLPITIME_LPITIME_DEFAULT                    (_ETH_TXLPITIME_LPITIME_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_TXLPITIME */

/* Bit fields for ETH TXBDCTRL */
#define _ETH_TXBDCTRL_RESETVALUE                         0x00000000UL                            /**< Default value for ETH_TXBDCTRL */
#define _ETH_TXBDCTRL_MASK                               0x00000030UL                            /**< Mask for ETH_TXBDCTRL */
#define _ETH_TXBDCTRL_TXBDTSMODE_SHIFT                   4                                       /**< Shift value for ETH_TXBDTSMODE */
#define _ETH_TXBDCTRL_TXBDTSMODE_MASK                    0x30UL                                  /**< Bit mask for ETH_TXBDTSMODE */
#define _ETH_TXBDCTRL_TXBDTSMODE_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_TXBDCTRL */
#define ETH_TXBDCTRL_TXBDTSMODE_DEFAULT                  (_ETH_TXBDCTRL_TXBDTSMODE_DEFAULT << 4) /**< Shifted mode DEFAULT for ETH_TXBDCTRL */

/* Bit fields for ETH RXBDCTRL */
#define _ETH_RXBDCTRL_RESETVALUE                         0x00000000UL                            /**< Default value for ETH_RXBDCTRL */
#define _ETH_RXBDCTRL_MASK                               0x00000030UL                            /**< Mask for ETH_RXBDCTRL */
#define _ETH_RXBDCTRL_RXBDTSMODE_SHIFT                   4                                       /**< Shift value for ETH_RXBDTSMODE */
#define _ETH_RXBDCTRL_RXBDTSMODE_MASK                    0x30UL                                  /**< Bit mask for ETH_RXBDTSMODE */
#define _ETH_RXBDCTRL_RXBDTSMODE_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for ETH_RXBDCTRL */
#define ETH_RXBDCTRL_RXBDTSMODE_DEFAULT                  (_ETH_RXBDCTRL_RXBDTSMODE_DEFAULT << 4) /**< Shifted mode DEFAULT for ETH_RXBDCTRL */

/* Bit fields for ETH ROUTEPEN */
#define _ETH_ROUTEPEN_RESETVALUE                         0x00000000UL                              /**< Default value for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MASK                               0x0000003FUL                              /**< Mask for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MDIOPEN                             (0x1UL << 0)                              /**< MDIO I/O Enable */
#define _ETH_ROUTEPEN_MDIOPEN_SHIFT                      0                                         /**< Shift value for ETH_MDIOPEN */
#define _ETH_ROUTEPEN_MDIOPEN_MASK                       0x1UL                                     /**< Bit mask for ETH_MDIOPEN */
#define _ETH_ROUTEPEN_MDIOPEN_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MDIOPEN_DISABLE                    0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MDIOPEN_ENABLE                     0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MDIOPEN_DEFAULT                     (_ETH_ROUTEPEN_MDIOPEN_DEFAULT << 0)      /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MDIOPEN_DISABLE                     (_ETH_ROUTEPEN_MDIOPEN_DISABLE << 0)      /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MDIOPEN_ENABLE                      (_ETH_ROUTEPEN_MDIOPEN_ENABLE << 0)       /**< Shifted mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIITXERPEN                          (0x1UL << 1)                              /**< MII TX ER I/O Enable */
#define _ETH_ROUTEPEN_MIITXERPEN_SHIFT                   1                                         /**< Shift value for ETH_MIITXERPEN */
#define _ETH_ROUTEPEN_MIITXERPEN_MASK                    0x2UL                                     /**< Bit mask for ETH_MIITXERPEN */
#define _ETH_ROUTEPEN_MIITXERPEN_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIITXERPEN_DISABLE                 0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIITXERPEN_ENABLE                  0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIITXERPEN_DEFAULT                  (_ETH_ROUTEPEN_MIITXERPEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIITXERPEN_DISABLE                  (_ETH_ROUTEPEN_MIITXERPEN_DISABLE << 1)   /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIITXERPEN_ENABLE                   (_ETH_ROUTEPEN_MIITXERPEN_ENABLE << 1)    /**< Shifted mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIRXERPEN                          (0x1UL << 2)                              /**< MII TX ER I/O Enable */
#define _ETH_ROUTEPEN_MIIRXERPEN_SHIFT                   2                                         /**< Shift value for ETH_MIIRXERPEN */
#define _ETH_ROUTEPEN_MIIRXERPEN_MASK                    0x4UL                                     /**< Bit mask for ETH_MIIRXERPEN */
#define _ETH_ROUTEPEN_MIIRXERPEN_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIIRXERPEN_DISABLE                 0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIIRXERPEN_ENABLE                  0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIRXERPEN_DEFAULT                  (_ETH_ROUTEPEN_MIIRXERPEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIRXERPEN_DISABLE                  (_ETH_ROUTEPEN_MIIRXERPEN_DISABLE << 2)   /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIRXERPEN_ENABLE                   (_ETH_ROUTEPEN_MIIRXERPEN_ENABLE << 2)    /**< Shifted mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIPEN                              (0x1UL << 3)                              /**< MII I/O Enable */
#define _ETH_ROUTEPEN_MIIPEN_SHIFT                       3                                         /**< Shift value for ETH_MIIPEN */
#define _ETH_ROUTEPEN_MIIPEN_MASK                        0x8UL                                     /**< Bit mask for ETH_MIIPEN */
#define _ETH_ROUTEPEN_MIIPEN_DEFAULT                     0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIIPEN_DISABLE                     0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_MIIPEN_ENABLE                      0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIPEN_DEFAULT                      (_ETH_ROUTEPEN_MIIPEN_DEFAULT << 3)       /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIPEN_DISABLE                      (_ETH_ROUTEPEN_MIIPEN_DISABLE << 3)       /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_MIIPEN_ENABLE                       (_ETH_ROUTEPEN_MIIPEN_ENABLE << 3)        /**< Shifted mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_RMIIPEN                             (0x1UL << 4)                              /**< RMII I/O Enable */
#define _ETH_ROUTEPEN_RMIIPEN_SHIFT                      4                                         /**< Shift value for ETH_RMIIPEN */
#define _ETH_ROUTEPEN_RMIIPEN_MASK                       0x10UL                                    /**< Bit mask for ETH_RMIIPEN */
#define _ETH_ROUTEPEN_RMIIPEN_DEFAULT                    0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_RMIIPEN_DISABLE                    0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_RMIIPEN_ENABLE                     0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_RMIIPEN_DEFAULT                     (_ETH_ROUTEPEN_RMIIPEN_DEFAULT << 4)      /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_RMIIPEN_DISABLE                     (_ETH_ROUTEPEN_RMIIPEN_DISABLE << 4)      /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_RMIIPEN_ENABLE                      (_ETH_ROUTEPEN_RMIIPEN_ENABLE << 4)       /**< Shifted mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_TSUTMRTOGPEN                        (0x1UL << 5)                              /**< TSU_TMR_CNT_SEC Output Enable */
#define _ETH_ROUTEPEN_TSUTMRTOGPEN_SHIFT                 5                                         /**< Shift value for ETH_TSUTMRTOGPEN */
#define _ETH_ROUTEPEN_TSUTMRTOGPEN_MASK                  0x20UL                                    /**< Bit mask for ETH_TSUTMRTOGPEN */
#define _ETH_ROUTEPEN_TSUTMRTOGPEN_DEFAULT               0x00000000UL                              /**< Mode DEFAULT for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_TSUTMRTOGPEN_DISABLE               0x00000000UL                              /**< Mode DISABLE for ETH_ROUTEPEN */
#define _ETH_ROUTEPEN_TSUTMRTOGPEN_ENABLE                0x00000001UL                              /**< Mode ENABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_TSUTMRTOGPEN_DEFAULT                (_ETH_ROUTEPEN_TSUTMRTOGPEN_DEFAULT << 5) /**< Shifted mode DEFAULT for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_TSUTMRTOGPEN_DISABLE                (_ETH_ROUTEPEN_TSUTMRTOGPEN_DISABLE << 5) /**< Shifted mode DISABLE for ETH_ROUTEPEN */
#define ETH_ROUTEPEN_TSUTMRTOGPEN_ENABLE                 (_ETH_ROUTEPEN_TSUTMRTOGPEN_ENABLE << 5)  /**< Shifted mode ENABLE for ETH_ROUTEPEN */

/* Bit fields for ETH ROUTELOC0 */
#define _ETH_ROUTELOC0_RESETVALUE                        0x00000000UL                             /**< Default value for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MASK                              0x03030301UL                             /**< Mask for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIITXLOC_SHIFT                    0                                        /**< Shift value for ETH_MIITXLOC */
#define _ETH_ROUTELOC0_MIITXLOC_MASK                     0x1UL                                    /**< Bit mask for ETH_MIITXLOC */
#define _ETH_ROUTELOC0_MIITXLOC_LOC0                     0x00000000UL                             /**< Mode LOC0 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIITXLOC_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIITXLOC_LOC1                     0x00000001UL                             /**< Mode LOC1 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIITXLOC_LOC0                      (_ETH_ROUTELOC0_MIITXLOC_LOC0 << 0)      /**< Shifted mode LOC0 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIITXLOC_DEFAULT                   (_ETH_ROUTELOC0_MIITXLOC_DEFAULT << 0)   /**< Shifted mode DEFAULT for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIITXLOC_LOC1                      (_ETH_ROUTELOC0_MIITXLOC_LOC1 << 0)      /**< Shifted mode LOC1 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIIRXLOC_SHIFT                    8                                        /**< Shift value for ETH_MIIRXLOC */
#define _ETH_ROUTELOC0_MIIRXLOC_MASK                     0x300UL                                  /**< Bit mask for ETH_MIIRXLOC */
#define _ETH_ROUTELOC0_MIIRXLOC_LOC0                     0x00000000UL                             /**< Mode LOC0 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIIRXLOC_DEFAULT                  0x00000000UL                             /**< Mode DEFAULT for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIIRXLOC_LOC1                     0x00000001UL                             /**< Mode LOC1 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIIRXLOC_LOC2                     0x00000002UL                             /**< Mode LOC2 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIIRXLOC_LOC0                      (_ETH_ROUTELOC0_MIIRXLOC_LOC0 << 8)      /**< Shifted mode LOC0 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIIRXLOC_DEFAULT                   (_ETH_ROUTELOC0_MIIRXLOC_DEFAULT << 8)   /**< Shifted mode DEFAULT for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIIRXLOC_LOC1                      (_ETH_ROUTELOC0_MIIRXLOC_LOC1 << 8)      /**< Shifted mode LOC1 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIIRXLOC_LOC2                      (_ETH_ROUTELOC0_MIIRXLOC_LOC2 << 8)      /**< Shifted mode LOC2 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICRSLOC_SHIFT                   16                                       /**< Shift value for ETH_MIICRSLOC */
#define _ETH_ROUTELOC0_MIICRSLOC_MASK                    0x30000UL                                /**< Bit mask for ETH_MIICRSLOC */
#define _ETH_ROUTELOC0_MIICRSLOC_LOC0                    0x00000000UL                             /**< Mode LOC0 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICRSLOC_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICRSLOC_LOC1                    0x00000001UL                             /**< Mode LOC1 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICRSLOC_LOC2                    0x00000002UL                             /**< Mode LOC2 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICRSLOC_LOC0                     (_ETH_ROUTELOC0_MIICRSLOC_LOC0 << 16)    /**< Shifted mode LOC0 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICRSLOC_DEFAULT                  (_ETH_ROUTELOC0_MIICRSLOC_DEFAULT << 16) /**< Shifted mode DEFAULT for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICRSLOC_LOC1                     (_ETH_ROUTELOC0_MIICRSLOC_LOC1 << 16)    /**< Shifted mode LOC1 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICRSLOC_LOC2                     (_ETH_ROUTELOC0_MIICRSLOC_LOC2 << 16)    /**< Shifted mode LOC2 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICOLLOC_SHIFT                   24                                       /**< Shift value for ETH_MIICOLLOC */
#define _ETH_ROUTELOC0_MIICOLLOC_MASK                    0x3000000UL                              /**< Bit mask for ETH_MIICOLLOC */
#define _ETH_ROUTELOC0_MIICOLLOC_LOC0                    0x00000000UL                             /**< Mode LOC0 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICOLLOC_DEFAULT                 0x00000000UL                             /**< Mode DEFAULT for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICOLLOC_LOC1                    0x00000001UL                             /**< Mode LOC1 for ETH_ROUTELOC0 */
#define _ETH_ROUTELOC0_MIICOLLOC_LOC2                    0x00000002UL                             /**< Mode LOC2 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICOLLOC_LOC0                     (_ETH_ROUTELOC0_MIICOLLOC_LOC0 << 24)    /**< Shifted mode LOC0 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICOLLOC_DEFAULT                  (_ETH_ROUTELOC0_MIICOLLOC_DEFAULT << 24) /**< Shifted mode DEFAULT for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICOLLOC_LOC1                     (_ETH_ROUTELOC0_MIICOLLOC_LOC1 << 24)    /**< Shifted mode LOC1 for ETH_ROUTELOC0 */
#define ETH_ROUTELOC0_MIICOLLOC_LOC2                     (_ETH_ROUTELOC0_MIICOLLOC_LOC2 << 24)    /**< Shifted mode LOC2 for ETH_ROUTELOC0 */

