RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_eth.h
/* Bit fields for ETH ROUTELOC1 */
#define _ETH_ROUTELOC1_RESETVALUE                        0x00000000UL                               /**< Default value for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MASK                              0x01030303UL                               /**< Mask for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_SHIFT                0                                          /**< Shift value for ETH_TSUEXTCLKLOC */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_MASK                 0x3UL                                      /**< Bit mask for ETH_TSUEXTCLKLOC */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_LOC0                 0x00000000UL                               /**< Mode LOC0 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_LOC1                 0x00000001UL                               /**< Mode LOC1 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_LOC2                 0x00000002UL                               /**< Mode LOC2 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUEXTCLKLOC_LOC3                 0x00000003UL                               /**< Mode LOC3 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUEXTCLKLOC_LOC0                  (_ETH_ROUTELOC1_TSUEXTCLKLOC_LOC0 << 0)    /**< Shifted mode LOC0 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUEXTCLKLOC_DEFAULT               (_ETH_ROUTELOC1_TSUEXTCLKLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUEXTCLKLOC_LOC1                  (_ETH_ROUTELOC1_TSUEXTCLKLOC_LOC1 << 0)    /**< Shifted mode LOC1 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUEXTCLKLOC_LOC2                  (_ETH_ROUTELOC1_TSUEXTCLKLOC_LOC2 << 0)    /**< Shifted mode LOC2 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUEXTCLKLOC_LOC3                  (_ETH_ROUTELOC1_TSUEXTCLKLOC_LOC3 << 0)    /**< Shifted mode LOC3 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_SHIFT                8                                          /**< Shift value for ETH_TSUTMRTOGLOC */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_MASK                 0x300UL                                    /**< Bit mask for ETH_TSUTMRTOGLOC */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_LOC0                 0x00000000UL                               /**< Mode LOC0 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_LOC1                 0x00000001UL                               /**< Mode LOC1 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_LOC2                 0x00000002UL                               /**< Mode LOC2 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_TSUTMRTOGLOC_LOC3                 0x00000003UL                               /**< Mode LOC3 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUTMRTOGLOC_LOC0                  (_ETH_ROUTELOC1_TSUTMRTOGLOC_LOC0 << 8)    /**< Shifted mode LOC0 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUTMRTOGLOC_DEFAULT               (_ETH_ROUTELOC1_TSUTMRTOGLOC_DEFAULT << 8) /**< Shifted mode DEFAULT for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUTMRTOGLOC_LOC1                  (_ETH_ROUTELOC1_TSUTMRTOGLOC_LOC1 << 8)    /**< Shifted mode LOC1 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUTMRTOGLOC_LOC2                  (_ETH_ROUTELOC1_TSUTMRTOGLOC_LOC2 << 8)    /**< Shifted mode LOC2 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_TSUTMRTOGLOC_LOC3                  (_ETH_ROUTELOC1_TSUTMRTOGLOC_LOC3 << 8)    /**< Shifted mode LOC3 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MDIOLOC_SHIFT                     16                                         /**< Shift value for ETH_MDIOLOC */
#define _ETH_ROUTELOC1_MDIOLOC_MASK                      0x30000UL                                  /**< Bit mask for ETH_MDIOLOC */
#define _ETH_ROUTELOC1_MDIOLOC_LOC0                      0x00000000UL                               /**< Mode LOC0 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MDIOLOC_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MDIOLOC_LOC1                      0x00000001UL                               /**< Mode LOC1 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MDIOLOC_LOC2                      0x00000002UL                               /**< Mode LOC2 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_MDIOLOC_LOC3                      0x00000003UL                               /**< Mode LOC3 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_MDIOLOC_LOC0                       (_ETH_ROUTELOC1_MDIOLOC_LOC0 << 16)        /**< Shifted mode LOC0 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_MDIOLOC_DEFAULT                    (_ETH_ROUTELOC1_MDIOLOC_DEFAULT << 16)     /**< Shifted mode DEFAULT for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_MDIOLOC_LOC1                       (_ETH_ROUTELOC1_MDIOLOC_LOC1 << 16)        /**< Shifted mode LOC1 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_MDIOLOC_LOC2                       (_ETH_ROUTELOC1_MDIOLOC_LOC2 << 16)        /**< Shifted mode LOC2 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_MDIOLOC_LOC3                       (_ETH_ROUTELOC1_MDIOLOC_LOC3 << 16)        /**< Shifted mode LOC3 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_RMIILOC_SHIFT                     24                                         /**< Shift value for ETH_RMIILOC */
#define _ETH_ROUTELOC1_RMIILOC_MASK                      0x1000000UL                                /**< Bit mask for ETH_RMIILOC */
#define _ETH_ROUTELOC1_RMIILOC_LOC0                      0x00000000UL                               /**< Mode LOC0 for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_RMIILOC_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for ETH_ROUTELOC1 */
#define _ETH_ROUTELOC1_RMIILOC_LOC1                      0x00000001UL                               /**< Mode LOC1 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_RMIILOC_LOC0                       (_ETH_ROUTELOC1_RMIILOC_LOC0 << 24)        /**< Shifted mode LOC0 for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_RMIILOC_DEFAULT                    (_ETH_ROUTELOC1_RMIILOC_DEFAULT << 24)     /**< Shifted mode DEFAULT for ETH_ROUTELOC1 */
#define ETH_ROUTELOC1_RMIILOC_LOC1                       (_ETH_ROUTELOC1_RMIILOC_LOC1 << 24)        /**< Shifted mode LOC1 for ETH_ROUTELOC1 */

/* Bit fields for ETH CTRL */
#define _ETH_CTRL_RESETVALUE                             0x00000000UL                            /**< Default value for ETH_CTRL */
#define _ETH_CTRL_MASK                                   0x000007F7UL                            /**< Mask for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_SHIFT                        0                                       /**< Shift value for ETH_TSUCLKSEL */
#define _ETH_CTRL_TSUCLKSEL_MASK                         0x7UL                                   /**< Bit mask for ETH_TSUCLKSEL */
#define _ETH_CTRL_TSUCLKSEL_DEFAULT                      0x00000000UL                            /**< Mode DEFAULT for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_NOCLOCK                      0x00000000UL                            /**< Mode NOCLOCK for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_PLL                          0x00000001UL                            /**< Mode PLL for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_RXCLK                        0x00000002UL                            /**< Mode RXCLK for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_REFCLK                       0x00000003UL                            /**< Mode REFCLK for ETH_CTRL */
#define _ETH_CTRL_TSUCLKSEL_TSUEXTCLK                    0x00000004UL                            /**< Mode TSUEXTCLK for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_DEFAULT                       (_ETH_CTRL_TSUCLKSEL_DEFAULT << 0)      /**< Shifted mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_NOCLOCK                       (_ETH_CTRL_TSUCLKSEL_NOCLOCK << 0)      /**< Shifted mode NOCLOCK for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_PLL                           (_ETH_CTRL_TSUCLKSEL_PLL << 0)          /**< Shifted mode PLL for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_RXCLK                         (_ETH_CTRL_TSUCLKSEL_RXCLK << 0)        /**< Shifted mode RXCLK for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_REFCLK                        (_ETH_CTRL_TSUCLKSEL_REFCLK << 0)       /**< Shifted mode REFCLK for ETH_CTRL */
#define ETH_CTRL_TSUCLKSEL_TSUEXTCLK                     (_ETH_CTRL_TSUCLKSEL_TSUEXTCLK << 0)    /**< Shifted mode TSUEXTCLK for ETH_CTRL */
#define _ETH_CTRL_TSUPRESC_SHIFT                         4                                       /**< Shift value for ETH_TSUPRESC */
#define _ETH_CTRL_TSUPRESC_MASK                          0xF0UL                                  /**< Bit mask for ETH_TSUPRESC */
#define _ETH_CTRL_TSUPRESC_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_TSUPRESC_DEFAULT                        (_ETH_CTRL_TSUPRESC_DEFAULT << 4)       /**< Shifted mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_MIISEL                                  (0x1UL << 8)                            /**< MII select signal */
#define _ETH_CTRL_MIISEL_SHIFT                           8                                       /**< Shift value for ETH_MIISEL */
#define _ETH_CTRL_MIISEL_MASK                            0x100UL                                 /**< Bit mask for ETH_MIISEL */
#define _ETH_CTRL_MIISEL_DEFAULT                         0x00000000UL                            /**< Mode DEFAULT for ETH_CTRL */
#define _ETH_CTRL_MIISEL_RMII                            0x00000000UL                            /**< Mode RMII for ETH_CTRL */
#define _ETH_CTRL_MIISEL_MII                             0x00000001UL                            /**< Mode MII for ETH_CTRL */
#define ETH_CTRL_MIISEL_DEFAULT                          (_ETH_CTRL_MIISEL_DEFAULT << 8)         /**< Shifted mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_MIISEL_RMII                             (_ETH_CTRL_MIISEL_RMII << 8)            /**< Shifted mode RMII for ETH_CTRL */
#define ETH_CTRL_MIISEL_MII                              (_ETH_CTRL_MIISEL_MII << 8)             /**< Shifted mode MII for ETH_CTRL */
#define ETH_CTRL_GBLCLKEN                                (0x1UL << 9)                            /**< Global Clock Enable signal for Ethernet clocks tsu_clk, tx_clk, rx_clk and ref_clk */
#define _ETH_CTRL_GBLCLKEN_SHIFT                         9                                       /**< Shift value for ETH_GBLCLKEN */
#define _ETH_CTRL_GBLCLKEN_MASK                          0x200UL                                 /**< Bit mask for ETH_GBLCLKEN */
#define _ETH_CTRL_GBLCLKEN_DEFAULT                       0x00000000UL                            /**< Mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_GBLCLKEN_DEFAULT                        (_ETH_CTRL_GBLCLKEN_DEFAULT << 9)       /**< Shifted mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_TXREFCLKSEL                             (0x1UL << 10)                           /**< REFCLK source select for RMII_TXD and RMII_TX_EN */
#define _ETH_CTRL_TXREFCLKSEL_SHIFT                      10                                      /**< Shift value for ETH_TXREFCLKSEL */
#define _ETH_CTRL_TXREFCLKSEL_MASK                       0x400UL                                 /**< Bit mask for ETH_TXREFCLKSEL */
#define _ETH_CTRL_TXREFCLKSEL_DEFAULT                    0x00000000UL                            /**< Mode DEFAULT for ETH_CTRL */
#define _ETH_CTRL_TXREFCLKSEL_REFCLKINT                  0x00000000UL                            /**< Mode REFCLKINT for ETH_CTRL */
#define _ETH_CTRL_TXREFCLKSEL_REFCLKPIN                  0x00000001UL                            /**< Mode REFCLKPIN for ETH_CTRL */
#define ETH_CTRL_TXREFCLKSEL_DEFAULT                     (_ETH_CTRL_TXREFCLKSEL_DEFAULT << 10)   /**< Shifted mode DEFAULT for ETH_CTRL */
#define ETH_CTRL_TXREFCLKSEL_REFCLKINT                   (_ETH_CTRL_TXREFCLKSEL_REFCLKINT << 10) /**< Shifted mode REFCLKINT for ETH_CTRL */
#define ETH_CTRL_TXREFCLKSEL_REFCLKPIN                   (_ETH_CTRL_TXREFCLKSEL_REFCLKPIN << 10) /**< Shifted mode REFCLKPIN for ETH_CTRL */

/** @} */
/** @} End of group EFM32GG11B_ETH */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

